/* automatically generated by rust-bindgen 0.69.4 */

pub const _FILE_OFFSET_BITS: u32 = 64;
pub const _LIBC_LIMITS_H_: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC23: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_FILE_OFFSET64: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_TIME_BITS64: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C23_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;

pub const LIBRAW_PROGRESS_THUMB_MASK: u32 = 268435455;
pub const LIBRAW_MAJOR_VERSION: u32 = 0;
pub const LIBRAW_MINOR_VERSION: u32 = 21;
pub const LIBRAW_PATCH_VERSION: u32 = 3;
pub const LIBRAW_SHLIB_CURRENT: u32 = 23;
pub const LIBRAW_SHLIB_REVISION: u32 = 0;
pub const LIBRAW_SHLIB_AGE: u32 = 0;
pub const LibRawBigEndian: u32 = 0;
pub const LIBRAW_HISTOGRAM_SIZE: u32 = 8192;
extern "C" {
    pub fn memcpy(
        __dest: *mut libc::c_void,
        __src: *const libc::c_void,
        __n: libc::c_ulong,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut libc::c_void,
        __src: *const libc::c_void,
        __n: libc::c_ulong,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut libc::c_void,
        __src: *const libc::c_void,
        __c: libc::c_int,
        __n: libc::c_ulong,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut libc::c_void,
        __c: libc::c_int,
        __n: libc::c_ulong,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const libc::c_void,
        __s2: *const libc::c_void,
        __n: libc::c_ulong,
    ) -> libc::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const libc::c_void,
        __c: libc::c_int,
        __n: libc::c_ulong,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn strcpy(__dest: *mut libc::c_char, __src: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut libc::c_char,
        __src: *const libc::c_char,
        __n: libc::c_ulong,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcat(__dest: *mut libc::c_char, __src: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut libc::c_char,
        __src: *const libc::c_char,
        __n: libc::c_ulong,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcmp(__s1: *const libc::c_char, __s2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const libc::c_char,
        __s2: *const libc::c_char,
        __n: libc::c_ulong,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strcoll(__s1: *const libc::c_char, __s2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut libc::c_char,
        __src: *const libc::c_char,
        __n: libc::c_ulong,
    ) -> libc::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const libc::c_ushort,
    pub __ctype_tolower: *const libc::c_int,
    pub __ctype_toupper: *const libc::c_int,
    pub __names: [*const libc::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    const UNINIT: ::core::mem::MaybeUninit<__locale_struct> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::core::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__locales) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__ctype_b) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__ctype_tolower) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__ctype_toupper) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__names) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const libc::c_char,
        __s2: *const libc::c_char,
        __l: locale_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut libc::c_char,
        __src: *const libc::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strndup(__string: *const libc::c_char, __n: libc::c_ulong) -> *mut libc::c_char;
}
extern "C" {
    pub fn strchr(__s: *const libc::c_char, __c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strrchr(__s: *const libc::c_char, __c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strchrnul(__s: *const libc::c_char, __c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcspn(__s: *const libc::c_char, __reject: *const libc::c_char) -> libc::c_ulong;
}
extern "C" {
    pub fn strspn(__s: *const libc::c_char, __accept: *const libc::c_char) -> libc::c_ulong;
}
extern "C" {
    pub fn strpbrk(__s: *const libc::c_char, __accept: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const libc::c_char,
        __needle: *const libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strtok(__s: *mut libc::c_char, __delim: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut libc::c_char,
        __delim: *const libc::c_char,
        __save_ptr: *mut *mut libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcasestr(
        __haystack: *const libc::c_char,
        __needle: *const libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn memmem(
        __haystack: *const libc::c_void,
        __haystacklen: usize,
        __needle: *const libc::c_void,
        __needlelen: usize,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn mempcpy(
        __dest: *mut libc::c_void,
        __src: *const libc::c_void,
        __n: libc::c_ulong,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn strlen(__s: *const libc::c_char) -> libc::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const libc::c_char, __maxlen: usize) -> usize;
}
extern "C" {
    pub fn strerror(__errnum: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: libc::c_int,
        __buf: *mut libc::c_char,
        __buflen: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strerror_l(__errnum: libc::c_int, __l: locale_t) -> *mut libc::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const libc::c_void,
        __s2: *const libc::c_void,
        __n: libc::c_ulong,
    ) -> libc::c_int;
}
extern "C" {
    pub fn bcopy(__src: *const libc::c_void, __dest: *mut libc::c_void, __n: libc::c_ulong);
}
extern "C" {
    pub fn bzero(__s: *mut libc::c_void, __n: libc::c_ulong);
}
extern "C" {
    pub fn index(__s: *const libc::c_char, __c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn rindex(__s: *const libc::c_char, __c: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn ffs(__i: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn ffsl(__l: libc::c_long) -> libc::c_int;
}
extern "C" {
    pub fn ffsll(__ll: libc::c_longlong) -> libc::c_int;
}
extern "C" {
    pub fn strcasecmp(__s1: *const libc::c_char, __s2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const libc::c_char,
        __s2: *const libc::c_char,
        __n: libc::c_ulong,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const libc::c_char,
        __s2: *const libc::c_char,
        __loc: locale_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const libc::c_char,
        __s2: *const libc::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> libc::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut libc::c_void, __n: usize);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut libc::c_char,
        __delim: *const libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strsignal(__sig: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn stpcpy(__dest: *mut libc::c_char, __src: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut libc::c_char,
        __src: *const libc::c_char,
        __n: libc::c_ulong,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strlcpy(
        __dest: *mut libc::c_char,
        __src: *const libc::c_char,
        __n: libc::c_ulong,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn strlcat(
        __dest: *mut libc::c_char,
        __src: *const libc::c_char,
        __n: libc::c_ulong,
    ) -> libc::c_ulong;
}
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = libc::c_uchar;
pub type __u_short = libc::c_ushort;
pub type __u_int = libc::c_uint;
pub type __u_long = libc::c_ulong;
pub type __int8_t = libc::c_schar;
pub type __uint8_t = libc::c_uchar;
pub type __int16_t = libc::c_short;
pub type __uint16_t = libc::c_ushort;
pub type __int32_t = libc::c_int;
pub type __uint32_t = libc::c_uint;
pub type __int64_t = libc::c_long;
pub type __uint64_t = libc::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = libc::c_long;
pub type __u_quad_t = libc::c_ulong;
pub type __intmax_t = libc::c_long;
pub type __uintmax_t = libc::c_ulong;
pub type __dev_t = libc::c_ulong;
pub type __uid_t = libc::c_uint;
pub type __gid_t = libc::c_uint;
pub type __ino_t = libc::c_ulong;
pub type __ino64_t = libc::c_ulong;
pub type __mode_t = libc::c_uint;
pub type __nlink_t = libc::c_ulong;
pub type __off_t = libc::c_long;
pub type __off64_t = libc::c_long;
pub type __pid_t = libc::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __fsid_t {
    pub __val: [libc::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::core::mem::MaybeUninit<__fsid_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = libc::c_long;
pub type __rlim_t = libc::c_ulong;
pub type __rlim64_t = libc::c_ulong;
pub type __id_t = libc::c_uint;
pub type __time_t = libc::c_long;
pub type __useconds_t = libc::c_uint;
pub type __suseconds_t = libc::c_long;
pub type __suseconds64_t = libc::c_long;
pub type __daddr_t = libc::c_int;
pub type __key_t = libc::c_int;
pub type __clockid_t = libc::c_int;
pub type __timer_t = *mut libc::c_void;
pub type __blksize_t = libc::c_long;
pub type __blkcnt_t = libc::c_long;
pub type __blkcnt64_t = libc::c_long;
pub type __fsblkcnt_t = libc::c_ulong;
pub type __fsblkcnt64_t = libc::c_ulong;
pub type __fsfilcnt_t = libc::c_ulong;
pub type __fsfilcnt64_t = libc::c_ulong;
pub type __fsword_t = libc::c_long;
pub type __ssize_t = libc::c_long;
pub type __syscall_slong_t = libc::c_long;
pub type __syscall_ulong_t = libc::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut libc::c_char;
pub type __intptr_t = libc::c_long;
pub type __socklen_t = libc::c_uint;
pub type __sig_atomic_t = libc::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: libc::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: libc::c_uint,
    pub __wchb: [libc::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<__mbstate_t__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::core::mem::MaybeUninit<__mbstate_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    const UNINIT: ::core::mem::MaybeUninit<_G_fpos_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    const UNINIT: ::core::mem::MaybeUninit<_G_fpos64_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = libc::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _IO_FILE {
    pub _flags: libc::c_int,
    pub _IO_read_ptr: *mut libc::c_char,
    pub _IO_read_end: *mut libc::c_char,
    pub _IO_read_base: *mut libc::c_char,
    pub _IO_write_base: *mut libc::c_char,
    pub _IO_write_ptr: *mut libc::c_char,
    pub _IO_write_end: *mut libc::c_char,
    pub _IO_buf_base: *mut libc::c_char,
    pub _IO_buf_end: *mut libc::c_char,
    pub _IO_save_base: *mut libc::c_char,
    pub _IO_backup_base: *mut libc::c_char,
    pub _IO_save_end: *mut libc::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: libc::c_int,
    pub _flags2: libc::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: libc::c_ushort,
    pub _vtable_offset: libc::c_schar,
    pub _shortbuf: [libc::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut libc::c_void,
    pub _prevchain: *mut *mut _IO_FILE,
    pub _mode: libc::c_int,
    pub _unused2: [libc::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::core::mem::MaybeUninit<_IO_FILE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._prevchain) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_prevchain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type cookie_read_function_t = ::core::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut libc::c_void,
        __buf: *mut libc::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_write_function_t = ::core::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut libc::c_void,
        __buf: *const libc::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_seek_function_t = ::core::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut libc::c_void,
        __pos: *mut __off64_t,
        __w: libc::c_int,
    ) -> libc::c_int,
>;
pub type cookie_close_function_t =
    ::core::option::Option<unsafe extern "C" fn(__cookie: *mut libc::c_void) -> libc::c_int>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _IO_cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[test]
fn bindgen_test_layout__IO_cookie_io_functions_t() {
    const UNINIT: ::core::mem::MaybeUninit<_IO_cookie_io_functions_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_IO_cookie_io_functions_t>(),
        32usize,
        concat!("Size of: ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_cookie_io_functions_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).read) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).seek) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).close) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(close)
        )
    );
}
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
pub type va_list = __gnuc_va_list;
pub type off_t = __off64_t;
pub type fpos_t = __fpos64_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn rename(__old: *const libc::c_char, __new: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: libc::c_int,
        __old: *const libc::c_char,
        __newfd: libc::c_int,
        __new: *const libc::c_char,
    ) -> libc::c_int;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}tmpfile64"]
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn tempnam(__dir: *const libc::c_char, __pfx: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}fopen64"]
    pub fn fopen(__filename: *const libc::c_char, __modes: *const libc::c_char) -> *mut FILE;
}
extern "C" {
    #[link_name = "\u{1}freopen64"]
    pub fn freopen(
        __filename: *const libc::c_char,
        __modes: *const libc::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: libc::c_int, __modes: *const libc::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fopencookie(
        __magic_cookie: *mut libc::c_void,
        __modes: *const libc::c_char,
        __io_funcs: cookie_io_functions_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut libc::c_void,
        __len: usize,
        __modes: *const libc::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(__bufloc: *mut *mut libc::c_char, __sizeloc: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut libc::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut libc::c_char,
        __modes: libc::c_int,
        __n: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut libc::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(__stream: *mut FILE, __format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn printf(__format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn sprintf(__s: *mut libc::c_char, __format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const libc::c_char,
        __arg: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vprintf(__format: *const libc::c_char, __arg: *mut __va_list_tag) -> libc::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut libc::c_char,
        __format: *const libc::c_char,
        __arg: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut libc::c_char,
        __maxlen: libc::c_ulong,
        __format: *const libc::c_char,
        ...
    ) -> libc::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut libc::c_char,
        __maxlen: libc::c_ulong,
        __format: *const libc::c_char,
        __arg: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vasprintf(
        __ptr: *mut *mut libc::c_char,
        __f: *const libc::c_char,
        __arg: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    pub fn asprintf(__ptr: *mut *mut libc::c_char, __fmt: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: libc::c_int,
        __fmt: *const libc::c_char,
        __arg: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    pub fn dprintf(__fd: libc::c_int, __fmt: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn fscanf(__stream: *mut FILE, __format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn scanf(__format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn sscanf(__s: *const libc::c_char, __format: *const libc::c_char, ...) -> libc::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(__stream: *mut FILE, __format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(__s: *const libc::c_char, __format: *const libc::c_char, ...) -> libc::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const libc::c_char,
        __arg: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    pub fn vscanf(__format: *const libc::c_char, __arg: *mut __va_list_tag) -> libc::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const libc::c_char,
        __format: *const libc::c_char,
        __arg: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const libc::c_char,
        __arg: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(__format: *const libc::c_char, __arg: *mut __va_list_tag) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const libc::c_char,
        __format: *const libc::c_char,
        __arg: *mut __va_list_tag,
    ) -> libc::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn getchar() -> libc::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> libc::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fputc(__c: libc::c_int, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putc(__c: libc::c_int, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putchar(__c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: libc::c_int, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: libc::c_int, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putw(__w: libc::c_int, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut libc::c_char,
        __n: libc::c_int,
        __stream: *mut FILE,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut libc::c_char,
        __n: *mut usize,
        __delimiter: libc::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut libc::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const libc::c_char, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn puts(__s: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn ungetc(__c: libc::c_int, __stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut libc::c_void,
        __size: libc::c_ulong,
        __n: libc::c_ulong,
        __stream: *mut FILE,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const libc::c_void,
        __size: libc::c_ulong,
        __n: libc::c_ulong,
        __s: *mut FILE,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut libc::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const libc::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(__stream: *mut FILE, __off: libc::c_long, __whence: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> libc::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    #[link_name = "\u{1}fseeko64"]
    pub fn fseeko(__stream: *mut FILE, __off: __off64_t, __whence: libc::c_int) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}ftello64"]
    pub fn ftello(__stream: *mut FILE) -> __off64_t;
}
extern "C" {
    #[link_name = "\u{1}fgetpos64"]
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}fsetpos64"]
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> libc::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn perror(__s: *const libc::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn popen(__command: *const libc::c_char, __modes: *const libc::c_char) -> *mut FILE;
}
extern "C" {
    pub fn ctermid(__s: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
pub type wchar_t = libc::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct div_t {
    pub quot: libc::c_int,
    pub rem: libc::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    const UNINIT: ::core::mem::MaybeUninit<div_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::core::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct ldiv_t {
    pub quot: libc::c_long,
    pub rem: libc::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<ldiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct lldiv_t {
    pub quot: libc::c_longlong,
    pub rem: libc::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<lldiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn atof(__nptr: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const libc::c_char) -> libc::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const libc::c_char) -> libc::c_longlong;
}
extern "C" {
    pub fn strtod(__nptr: *const libc::c_char, __endptr: *mut *mut libc::c_char) -> f64;
}
extern "C" {
    pub fn strtof(__nptr: *const libc::c_char, __endptr: *mut *mut libc::c_char) -> f32;
}
extern "C" {
    pub fn strtol(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: libc::c_long) -> *mut libc::c_char;
}
extern "C" {
    pub fn a64l(__s: *const libc::c_char) -> libc::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino64_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = libc::c_ulong;
pub type ushort = libc::c_ushort;
pub type uint = libc::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = libc::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __sigset_t {
    pub __val: [libc::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    const UNINIT: ::core::mem::MaybeUninit<__sigset_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::core::mem::MaybeUninit<timeval> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::core::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::core::mem::MaybeUninit<timespec> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::core::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = libc::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::core::mem::MaybeUninit<fd_set> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::core::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: libc::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> libc::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: libc::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> libc::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt64_t;
pub type fsblkcnt_t = __fsblkcnt64_t;
pub type fsfilcnt_t = __fsfilcnt64_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: libc::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: libc::c_uint,
    pub __high: libc::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<__atomic_wide_counter__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__atomic_wide_counter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    const UNINIT: ::core::mem::MaybeUninit<__atomic_wide_counter> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        ::core::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__value64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__value32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value32)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    const UNINIT: ::core::mem::MaybeUninit<__pthread_internal_list> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    const UNINIT: ::core::mem::MaybeUninit<__pthread_internal_slist> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __pthread_mutex_s {
    pub __lock: libc::c_int,
    pub __count: libc::c_uint,
    pub __owner: libc::c_int,
    pub __nusers: libc::c_uint,
    pub __kind: libc::c_int,
    pub __spins: libc::c_short,
    pub __elision: libc::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    const UNINIT: ::core::mem::MaybeUninit<__pthread_mutex_s> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__list) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: libc::c_uint,
    pub __writers: libc::c_uint,
    pub __wrphase_futex: libc::c_uint,
    pub __writers_futex: libc::c_uint,
    pub __pad3: libc::c_uint,
    pub __pad4: libc::c_uint,
    pub __cur_writer: libc::c_int,
    pub __shared: libc::c_int,
    pub __rwelision: libc::c_schar,
    pub __pad1: [libc::c_uchar; 7usize],
    pub __pad2: libc::c_ulong,
    pub __flags: libc::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    const UNINIT: ::core::mem::MaybeUninit<__pthread_rwlock_arch_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__readers) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__writers) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__wrphase_futex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__writers_futex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__cur_writer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__shared) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__rwelision) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [libc::c_uint; 2usize],
    pub __g_size: [libc::c_uint; 2usize],
    pub __g1_orig_size: libc::c_uint,
    pub __wrefs: libc::c_uint,
    pub __g_signals: [libc::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    const UNINIT: ::core::mem::MaybeUninit<__pthread_cond_s> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__g_refs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = libc::c_uint;
pub type __thrd_t = libc::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __once_flag {
    pub __data: libc::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    const UNINIT: ::core::mem::MaybeUninit<__once_flag> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::core::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = libc::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [libc::c_char; 4usize],
    pub __align: libc::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_mutexattr_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [libc::c_char; 4usize],
    pub __align: libc::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_condattr_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = libc::c_uint;
pub type pthread_once_t = libc::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [libc::c_char; 56usize],
    pub __align: libc::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_attr_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [libc::c_char; 40usize],
    pub __align: libc::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_mutex_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [libc::c_char; 48usize],
    pub __align: libc::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_cond_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [libc::c_char; 56usize],
    pub __align: libc::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_rwlock_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [libc::c_char; 8usize],
    pub __align: libc::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_rwlockattr_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = libc::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [libc::c_char; 32usize],
    pub __align: libc::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_barrier_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [libc::c_char; 4usize],
    pub __align: libc::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_barrierattr_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> libc::c_long;
}
extern "C" {
    pub fn srandom(__seed: libc::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: libc::c_uint,
        __statebuf: *mut libc::c_char,
        __statelen: usize,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut libc::c_char) -> *mut libc::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: libc::c_int,
    pub rand_deg: libc::c_int,
    pub rand_sep: libc::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    const UNINIT: ::core::mem::MaybeUninit<random_data> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::core::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rand_type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rand_deg) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rand_sep) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).end_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> libc::c_int;
}
extern "C" {
    pub fn srandom_r(__seed: libc::c_uint, __buf: *mut random_data) -> libc::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: libc::c_uint,
        __statebuf: *mut libc::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> libc::c_int;
}
extern "C" {
    pub fn setstate_r(__statebuf: *mut libc::c_char, __buf: *mut random_data) -> libc::c_int;
}
extern "C" {
    pub fn rand() -> libc::c_int;
}
extern "C" {
    pub fn srand(__seed: libc::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut libc::c_uint) -> libc::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut libc::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> libc::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut libc::c_ushort) -> libc::c_long;
}
extern "C" {
    pub fn mrand48() -> libc::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut libc::c_ushort) -> libc::c_long;
}
extern "C" {
    pub fn srand48(__seedval: libc::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut libc::c_ushort) -> *mut libc::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut libc::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct drand48_data {
    pub __x: [libc::c_ushort; 3usize],
    pub __old_x: [libc::c_ushort; 3usize],
    pub __c: libc::c_ushort,
    pub __init: libc::c_ushort,
    pub __a: libc::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    const UNINIT: ::core::mem::MaybeUninit<drand48_data> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::core::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__old_x) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__c) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__init) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__a) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> libc::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut libc::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> libc::c_int;
}
extern "C" {
    pub fn lrand48_r(__buffer: *mut drand48_data, __result: *mut libc::c_long) -> libc::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut libc::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut libc::c_long,
    ) -> libc::c_int;
}
extern "C" {
    pub fn mrand48_r(__buffer: *mut drand48_data, __result: *mut libc::c_long) -> libc::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut libc::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut libc::c_long,
    ) -> libc::c_int;
}
extern "C" {
    pub fn srand48_r(__seedval: libc::c_long, __buffer: *mut drand48_data) -> libc::c_int;
}
extern "C" {
    pub fn seed48_r(__seed16v: *mut libc::c_ushort, __buffer: *mut drand48_data) -> libc::c_int;
}
extern "C" {
    pub fn lcong48_r(__param: *mut libc::c_ushort, __buffer: *mut drand48_data) -> libc::c_int;
}
extern "C" {
    pub fn arc4random() -> __uint32_t;
}
extern "C" {
    pub fn arc4random_buf(__buf: *mut libc::c_void, __size: usize);
}
extern "C" {
    pub fn arc4random_uniform(__upper_bound: __uint32_t) -> __uint32_t;
}
extern "C" {
    pub fn malloc(__size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: libc::c_ulong, __size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn realloc(__ptr: *mut libc::c_void, __size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut libc::c_void);
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut libc::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn alloca(__size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut libc::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut libc::c_void,
        __alignment: usize,
        __size: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: libc::c_ulong, __size: libc::c_ulong) -> *mut libc::c_void;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn atexit(__func: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
extern "C" {
    pub fn at_quick_exit(__func: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::core::option::Option<
            unsafe extern "C" fn(__status: libc::c_int, __arg: *mut libc::c_void),
        >,
        __arg: *mut libc::c_void,
    ) -> libc::c_int;
}
extern "C" {
    pub fn exit(__status: libc::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(__status: libc::c_int) -> !;
}
extern "C" {
    pub fn getenv(__name: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const libc::c_char,
        __value: *const libc::c_char,
        __replace: libc::c_int,
    ) -> libc::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn clearenv() -> libc::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    #[link_name = "\u{1}mkstemp64"]
    pub fn mkstemp(__template: *mut libc::c_char) -> libc::c_int;
}
extern "C" {
    #[link_name = "\u{1}mkstemps64"]
    pub fn mkstemps(__template: *mut libc::c_char, __suffixlen: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn system(__command: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const libc::c_char,
        __resolved: *mut libc::c_char,
    ) -> *mut libc::c_char;
}
pub type __compar_fn_t = ::core::option::Option<
    unsafe extern "C" fn(arg1: *const libc::c_void, arg2: *const libc::c_void) -> libc::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const libc::c_void,
        __base: *const libc::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn qsort(__base: *mut libc::c_void, __nmemb: usize, __size: usize, __compar: __compar_fn_t);
}
extern "C" {
    pub fn abs(__x: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn labs(__x: libc::c_long) -> libc::c_long;
}
extern "C" {
    pub fn llabs(__x: libc::c_longlong) -> libc::c_longlong;
}
extern "C" {
    pub fn div(__numer: libc::c_int, __denom: libc::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: libc::c_long, __denom: libc::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(__numer: libc::c_longlong, __denom: libc::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: libc::c_int,
        __decpt: *mut libc::c_int,
        __sign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn gcvt(__value: f64, __ndigit: libc::c_int, __buf: *mut libc::c_char)
        -> *mut libc::c_char;
}
extern "C" {
    pub fn mblen(__s: *const libc::c_char, __n: usize) -> libc::c_int;
}
extern "C" {
    pub fn mbtowc(__pwc: *mut wchar_t, __s: *const libc::c_char, __n: usize) -> libc::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut libc::c_char, __wchar: wchar_t) -> libc::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const libc::c_char, __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut libc::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut libc::c_char,
        __tokens: *const *mut libc::c_char,
        __valuep: *mut *mut libc::c_char,
    ) -> libc::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: libc::c_int) -> libc::c_int;
}
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub fn acos(__x: f64) -> f64;
}
extern "C" {
    pub fn asin(__x: f64) -> f64;
}
extern "C" {
    pub fn atan(__x: f64) -> f64;
}
extern "C" {
    pub fn atan2(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn cos(__x: f64) -> f64;
}
extern "C" {
    pub fn sin(__x: f64) -> f64;
}
extern "C" {
    pub fn tan(__x: f64) -> f64;
}
extern "C" {
    pub fn cosh(__x: f64) -> f64;
}
extern "C" {
    pub fn sinh(__x: f64) -> f64;
}
extern "C" {
    pub fn tanh(__x: f64) -> f64;
}
extern "C" {
    pub fn acosh(__x: f64) -> f64;
}
extern "C" {
    pub fn asinh(__x: f64) -> f64;
}
extern "C" {
    pub fn atanh(__x: f64) -> f64;
}
extern "C" {
    pub fn exp(__x: f64) -> f64;
}
extern "C" {
    pub fn frexp(__x: f64, __exponent: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn ldexp(__x: f64, __exponent: libc::c_int) -> f64;
}
extern "C" {
    pub fn log(__x: f64) -> f64;
}
extern "C" {
    pub fn log10(__x: f64) -> f64;
}
extern "C" {
    pub fn modf(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn expm1(__x: f64) -> f64;
}
extern "C" {
    pub fn log1p(__x: f64) -> f64;
}
extern "C" {
    pub fn logb(__x: f64) -> f64;
}
extern "C" {
    pub fn exp2(__x: f64) -> f64;
}
extern "C" {
    pub fn log2(__x: f64) -> f64;
}
extern "C" {
    pub fn pow(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn sqrt(__x: f64) -> f64;
}
extern "C" {
    pub fn hypot(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn cbrt(__x: f64) -> f64;
}
extern "C" {
    pub fn ceil(__x: f64) -> f64;
}
extern "C" {
    pub fn fabs(__x: f64) -> f64;
}
extern "C" {
    pub fn floor(__x: f64) -> f64;
}
extern "C" {
    pub fn fmod(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn isinf(__value: f64) -> libc::c_int;
}
extern "C" {
    pub fn finite(__value: f64) -> libc::c_int;
}
extern "C" {
    pub fn drem(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn significand(__x: f64) -> f64;
}
extern "C" {
    pub fn copysign(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nan(__tagb: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn isnan(__value: f64) -> libc::c_int;
}
extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn jn(arg1: libc::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn yn(arg1: libc::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma_r(arg1: f64, __signgamp: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn rint(__x: f64) -> f64;
}
extern "C" {
    pub fn nextafter(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn remainder(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn scalbn(__x: f64, __n: libc::c_int) -> f64;
}
extern "C" {
    pub fn ilogb(__x: f64) -> libc::c_int;
}
extern "C" {
    pub fn scalbln(__x: f64, __n: libc::c_long) -> f64;
}
extern "C" {
    pub fn nearbyint(__x: f64) -> f64;
}
extern "C" {
    pub fn round(__x: f64) -> f64;
}
extern "C" {
    pub fn trunc(__x: f64) -> f64;
}
extern "C" {
    pub fn remquo(__x: f64, __y: f64, __quo: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn lrint(__x: f64) -> libc::c_long;
}
extern "C" {
    pub fn llrint(__x: f64) -> libc::c_longlong;
}
extern "C" {
    pub fn lround(__x: f64) -> libc::c_long;
}
extern "C" {
    pub fn llround(__x: f64) -> libc::c_longlong;
}
extern "C" {
    pub fn fdim(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmax(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmin(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fma(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn scalb(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn acosf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanf(__x: f32) -> f32;
}
extern "C" {
    pub fn atan2f(__y: f32, __x: f32) -> f32;
}
extern "C" {
    pub fn cosf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanf(__x: f32) -> f32;
}
extern "C" {
    pub fn coshf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn acoshf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn expf(__x: f32) -> f32;
}
extern "C" {
    pub fn frexpf(__x: f32, __exponent: *mut libc::c_int) -> f32;
}
extern "C" {
    pub fn ldexpf(__x: f32, __exponent: libc::c_int) -> f32;
}
extern "C" {
    pub fn logf(__x: f32) -> f32;
}
extern "C" {
    pub fn log10f(__x: f32) -> f32;
}
extern "C" {
    pub fn modff(__x: f32, __iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn expm1f(__x: f32) -> f32;
}
extern "C" {
    pub fn log1pf(__x: f32) -> f32;
}
extern "C" {
    pub fn logbf(__x: f32) -> f32;
}
extern "C" {
    pub fn exp2f(__x: f32) -> f32;
}
extern "C" {
    pub fn log2f(__x: f32) -> f32;
}
extern "C" {
    pub fn powf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn sqrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn hypotf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn cbrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn ceilf(__x: f32) -> f32;
}
extern "C" {
    pub fn fabsf(__x: f32) -> f32;
}
extern "C" {
    pub fn floorf(__x: f32) -> f32;
}
extern "C" {
    pub fn fmodf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn isinff(__value: f32) -> libc::c_int;
}
extern "C" {
    pub fn finitef(__value: f32) -> libc::c_int;
}
extern "C" {
    pub fn dremf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn significandf(__x: f32) -> f32;
}
extern "C" {
    pub fn copysignf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn nanf(__tagb: *const libc::c_char) -> f32;
}
extern "C" {
    pub fn isnanf(__value: f32) -> libc::c_int;
}
extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn jnf(arg1: libc::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn ynf(arg1: libc::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf_r(arg1: f32, __signgamp: *mut libc::c_int) -> f32;
}
extern "C" {
    pub fn rintf(__x: f32) -> f32;
}
extern "C" {
    pub fn nextafterf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn remainderf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn scalbnf(__x: f32, __n: libc::c_int) -> f32;
}
extern "C" {
    pub fn ilogbf(__x: f32) -> libc::c_int;
}
extern "C" {
    pub fn scalblnf(__x: f32, __n: libc::c_long) -> f32;
}
extern "C" {
    pub fn nearbyintf(__x: f32) -> f32;
}
extern "C" {
    pub fn roundf(__x: f32) -> f32;
}
extern "C" {
    pub fn truncf(__x: f32) -> f32;
}
extern "C" {
    pub fn remquof(__x: f32, __y: f32, __quo: *mut libc::c_int) -> f32;
}
extern "C" {
    pub fn lrintf(__x: f32) -> libc::c_long;
}
extern "C" {
    pub fn llrintf(__x: f32) -> libc::c_longlong;
}
extern "C" {
    pub fn lroundf(__x: f32) -> libc::c_long;
}
extern "C" {
    pub fn llroundf(__x: f32) -> libc::c_longlong;
}
extern "C" {
    pub fn fdimf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fmaxf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fminf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
extern "C" {
    pub fn scalbf(__x: f32, __n: f32) -> f32;
}
extern "C" {
    pub static mut signgam: libc::c_int;
}
pub const FP_NAN: _bindgen_ty_1 = 0;
pub const FP_INFINITE: _bindgen_ty_1 = 1;
pub const FP_ZERO: _bindgen_ty_1 = 2;
pub const FP_SUBNORMAL: _bindgen_ty_1 = 3;
pub const FP_NORMAL: _bindgen_ty_1 = 4;
pub type _bindgen_ty_1 = libc::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct timezone {
    pub tz_minuteswest: libc::c_int,
    pub tz_dsttime: libc::c_int,
}
#[test]
fn bindgen_test_layout_timezone() {
    const UNINIT: ::core::mem::MaybeUninit<timezone> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<timezone>(),
        8usize,
        concat!("Size of: ", stringify!(timezone))
    );
    assert_eq!(
        ::core::mem::align_of::<timezone>(),
        4usize,
        concat!("Alignment of ", stringify!(timezone))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tz_minuteswest) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_minuteswest)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tz_dsttime) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_dsttime)
        )
    );
}
extern "C" {
    pub fn gettimeofday(__tv: *mut timeval, __tz: *mut libc::c_void) -> libc::c_int;
}
extern "C" {
    pub fn settimeofday(__tv: *const timeval, __tz: *const timezone) -> libc::c_int;
}
extern "C" {
    pub fn adjtime(__delta: *const timeval, __olddelta: *mut timeval) -> libc::c_int;
}
pub const __itimer_which_ITIMER_REAL: __itimer_which = 0;
pub const __itimer_which_ITIMER_VIRTUAL: __itimer_which = 1;
pub const __itimer_which_ITIMER_PROF: __itimer_which = 2;
pub type __itimer_which = libc::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[test]
fn bindgen_test_layout_itimerval() {
    const UNINIT: ::core::mem::MaybeUninit<itimerval> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<itimerval>(),
        32usize,
        concat!("Size of: ", stringify!(itimerval))
    );
    assert_eq!(
        ::core::mem::align_of::<itimerval>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerval))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_value)
        )
    );
}
pub type __itimer_which_t = libc::c_int;
extern "C" {
    pub fn getitimer(__which: __itimer_which_t, __value: *mut itimerval) -> libc::c_int;
}
extern "C" {
    pub fn setitimer(
        __which: __itimer_which_t,
        __new: *const itimerval,
        __old: *mut itimerval,
    ) -> libc::c_int;
}
extern "C" {
    pub fn utimes(__file: *const libc::c_char, __tvp: *const timeval) -> libc::c_int;
}
extern "C" {
    pub fn lutimes(__file: *const libc::c_char, __tvp: *const timeval) -> libc::c_int;
}
extern "C" {
    pub fn futimes(__fd: libc::c_int, __tvp: *const timeval) -> libc::c_int;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = libc::c_schar;
pub type int_fast16_t = libc::c_long;
pub type int_fast32_t = libc::c_long;
pub type int_fast64_t = libc::c_long;
pub type uint_fast8_t = libc::c_uchar;
pub type uint_fast16_t = libc::c_ulong;
pub type uint_fast32_t = libc::c_ulong;
pub type uint_fast64_t = libc::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = libc::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct imaxdiv_t {
    pub quot: libc::c_long,
    pub rem: libc::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<imaxdiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const libc::c_char,
        __endptr: *mut *mut libc::c_char,
        __base: libc::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: libc::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: libc::c_int,
    ) -> uintmax_t;
}
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_RGGB: LibRaw_openbayer_patterns = 148;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_BGGR: LibRaw_openbayer_patterns = 22;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_GRBG: LibRaw_openbayer_patterns = 97;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_GBRG: LibRaw_openbayer_patterns = 73;
pub type LibRaw_openbayer_patterns = libc::c_uint;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_FORWARDMATRIX: LibRaw_dngfields_marks = 1;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_ILLUMINANT: LibRaw_dngfields_marks = 2;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_COLORMATRIX: LibRaw_dngfields_marks = 4;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_CALIBRATION: LibRaw_dngfields_marks = 8;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_ANALOGBALANCE: LibRaw_dngfields_marks = 16;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_BLACK: LibRaw_dngfields_marks = 32;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_WHITE: LibRaw_dngfields_marks = 64;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_OPCODE2: LibRaw_dngfields_marks = 128;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_LINTABLE: LibRaw_dngfields_marks = 256;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_CROPORIGIN: LibRaw_dngfields_marks = 512;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_CROPSIZE: LibRaw_dngfields_marks = 1024;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_PREVIEWCS: LibRaw_dngfields_marks = 2048;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_ASSHOTNEUTRAL: LibRaw_dngfields_marks = 4096;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_BASELINEEXPOSURE: LibRaw_dngfields_marks = 8192;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_LINEARRESPONSELIMIT: LibRaw_dngfields_marks = 16384;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_USERCROP: LibRaw_dngfields_marks = 32768;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_OPCODE1: LibRaw_dngfields_marks = 65536;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_OPCODE3: LibRaw_dngfields_marks = 131072;
pub type LibRaw_dngfields_marks = libc::c_uint;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_APPLIED: LibRaw_As_Shot_WB_Applied_codes = 1;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_CANON: LibRaw_As_Shot_WB_Applied_codes = 2;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_NIKON: LibRaw_As_Shot_WB_Applied_codes = 4;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_NIKON_SRAW: LibRaw_As_Shot_WB_Applied_codes =
    8;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_PENTAX: LibRaw_As_Shot_WB_Applied_codes = 16;
pub type LibRaw_As_Shot_WB_Applied_codes = libc::c_uint;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_UNKNOWN: LibRaw_ExifTagTypes = 0;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_BYTE: LibRaw_ExifTagTypes = 1;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_ASCII: LibRaw_ExifTagTypes = 2;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SHORT: LibRaw_ExifTagTypes = 3;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_LONG: LibRaw_ExifTagTypes = 4;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_RATIONAL: LibRaw_ExifTagTypes = 5;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SBYTE: LibRaw_ExifTagTypes = 6;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_UNDEFINED: LibRaw_ExifTagTypes = 7;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SSHORT: LibRaw_ExifTagTypes = 8;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SLONG: LibRaw_ExifTagTypes = 9;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SRATIONAL: LibRaw_ExifTagTypes = 10;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_FLOAT: LibRaw_ExifTagTypes = 11;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_DOUBLE: LibRaw_ExifTagTypes = 12;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_IFD: LibRaw_ExifTagTypes = 13;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_UNICODE: LibRaw_ExifTagTypes = 14;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_COMPLEX: LibRaw_ExifTagTypes = 15;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_LONG8: LibRaw_ExifTagTypes = 16;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SLONG8: LibRaw_ExifTagTypes = 17;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_IFD8: LibRaw_ExifTagTypes = 18;
pub type LibRaw_ExifTagTypes = libc::c_uint;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Unknown: LibRaw_whitebalance_code = 0;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Daylight: LibRaw_whitebalance_code = 1;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Fluorescent: LibRaw_whitebalance_code = 2;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Tungsten: LibRaw_whitebalance_code = 3;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Flash: LibRaw_whitebalance_code = 4;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FineWeather: LibRaw_whitebalance_code = 9;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Cloudy: LibRaw_whitebalance_code = 10;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Shade: LibRaw_whitebalance_code = 11;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_D: LibRaw_whitebalance_code = 12;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_N: LibRaw_whitebalance_code = 13;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_W: LibRaw_whitebalance_code = 14;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_WW: LibRaw_whitebalance_code = 15;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_L: LibRaw_whitebalance_code = 16;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Ill_A: LibRaw_whitebalance_code = 17;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Ill_B: LibRaw_whitebalance_code = 18;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Ill_C: LibRaw_whitebalance_code = 19;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D55: LibRaw_whitebalance_code = 20;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D65: LibRaw_whitebalance_code = 21;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D75: LibRaw_whitebalance_code = 22;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D50: LibRaw_whitebalance_code = 23;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_StudioTungsten: LibRaw_whitebalance_code = 24;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Sunset: LibRaw_whitebalance_code = 64;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Underwater: LibRaw_whitebalance_code = 65;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FluorescentHigh: LibRaw_whitebalance_code = 66;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_HT_Mercury: LibRaw_whitebalance_code = 67;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_AsShot: LibRaw_whitebalance_code = 81;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto: LibRaw_whitebalance_code = 82;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom: LibRaw_whitebalance_code = 83;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto1: LibRaw_whitebalance_code = 85;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto2: LibRaw_whitebalance_code = 86;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto3: LibRaw_whitebalance_code = 87;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto4: LibRaw_whitebalance_code = 88;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom1: LibRaw_whitebalance_code = 90;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom2: LibRaw_whitebalance_code = 91;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom3: LibRaw_whitebalance_code = 92;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom4: LibRaw_whitebalance_code = 93;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom5: LibRaw_whitebalance_code = 94;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom6: LibRaw_whitebalance_code = 95;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set1: LibRaw_whitebalance_code = 96;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set2: LibRaw_whitebalance_code = 97;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set3: LibRaw_whitebalance_code = 98;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set4: LibRaw_whitebalance_code = 99;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set5: LibRaw_whitebalance_code = 100;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Measured: LibRaw_whitebalance_code = 110;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_BW: LibRaw_whitebalance_code = 120;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Kelvin: LibRaw_whitebalance_code = 254;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Other: LibRaw_whitebalance_code = 255;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_None: LibRaw_whitebalance_code = 65535;
pub type LibRaw_whitebalance_code = libc::c_uint;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_NONE: LibRaw_MultiExposure_related = 0;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_SIMPLE: LibRaw_MultiExposure_related = 1;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_OVERLAY: LibRaw_MultiExposure_related = 2;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_HDR: LibRaw_MultiExposure_related = 3;
pub type LibRaw_MultiExposure_related = libc::c_uint;
pub const LibRaw_dng_processing_LIBRAW_DNG_NONE: LibRaw_dng_processing = 0;
pub const LibRaw_dng_processing_LIBRAW_DNG_FLOAT: LibRaw_dng_processing = 1;
pub const LibRaw_dng_processing_LIBRAW_DNG_LINEAR: LibRaw_dng_processing = 2;
pub const LibRaw_dng_processing_LIBRAW_DNG_DEFLATE: LibRaw_dng_processing = 4;
pub const LibRaw_dng_processing_LIBRAW_DNG_XTRANS: LibRaw_dng_processing = 8;
pub const LibRaw_dng_processing_LIBRAW_DNG_OTHER: LibRaw_dng_processing = 16;
pub const LibRaw_dng_processing_LIBRAW_DNG_8BIT: LibRaw_dng_processing = 32;
pub const LibRaw_dng_processing_LIBRAW_DNG_ALL: LibRaw_dng_processing = 63;
pub const LibRaw_dng_processing_LIBRAW_DNG_DEFAULT: LibRaw_dng_processing = 39;
pub type LibRaw_dng_processing = libc::c_uint;
pub const LibRaw_output_flags_LIBRAW_OUTPUT_FLAGS_NONE: LibRaw_output_flags = 0;
pub const LibRaw_output_flags_LIBRAW_OUTPUT_FLAGS_PPMMETA: LibRaw_output_flags = 1;
pub type LibRaw_output_flags = libc::c_uint;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RAWSPEED: LibRaw_runtime_capabilities = 1;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_DNGSDK: LibRaw_runtime_capabilities = 2;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_GPRSDK: LibRaw_runtime_capabilities = 4;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_UNICODEPATHS: LibRaw_runtime_capabilities = 8;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_X3FTOOLS: LibRaw_runtime_capabilities = 16;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RPI6BY9: LibRaw_runtime_capabilities = 32;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_ZLIB: LibRaw_runtime_capabilities = 64;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_JPEG: LibRaw_runtime_capabilities = 128;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RAWSPEED3: LibRaw_runtime_capabilities = 256;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RAWSPEED_BITS: LibRaw_runtime_capabilities = 512;
pub type LibRaw_runtime_capabilities = libc::c_uint;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_NotFound: LibRaw_colorspace = 0;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_sRGB: LibRaw_colorspace = 1;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_AdobeRGB: LibRaw_colorspace = 2;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_WideGamutRGB: LibRaw_colorspace = 3;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_ProPhotoRGB: LibRaw_colorspace = 4;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_ICC: LibRaw_colorspace = 5;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_Uncalibrated: LibRaw_colorspace = 6;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraLinearUniWB: LibRaw_colorspace = 7;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraLinear: LibRaw_colorspace = 8;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraGammaUniWB: LibRaw_colorspace = 9;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraGamma: LibRaw_colorspace = 10;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_MonochromeLinear: LibRaw_colorspace = 11;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_MonochromeGamma: LibRaw_colorspace = 12;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_Unknown: LibRaw_colorspace = 255;
pub type LibRaw_colorspace = libc::c_uint;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Unknown: LibRaw_cameramaker_index = 0;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Agfa: LibRaw_cameramaker_index = 1;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Alcatel: LibRaw_cameramaker_index = 2;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Apple: LibRaw_cameramaker_index = 3;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Aptina: LibRaw_cameramaker_index = 4;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_AVT: LibRaw_cameramaker_index = 5;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Baumer: LibRaw_cameramaker_index = 6;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Broadcom: LibRaw_cameramaker_index = 7;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Canon: LibRaw_cameramaker_index = 8;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Casio: LibRaw_cameramaker_index = 9;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_CINE: LibRaw_cameramaker_index = 10;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Clauss: LibRaw_cameramaker_index = 11;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Contax: LibRaw_cameramaker_index = 12;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Creative: LibRaw_cameramaker_index = 13;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_DJI: LibRaw_cameramaker_index = 14;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_DXO: LibRaw_cameramaker_index = 15;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Epson: LibRaw_cameramaker_index = 16;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Foculus: LibRaw_cameramaker_index = 17;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Fujifilm: LibRaw_cameramaker_index = 18;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Generic: LibRaw_cameramaker_index = 19;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Gione: LibRaw_cameramaker_index = 20;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_GITUP: LibRaw_cameramaker_index = 21;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Google: LibRaw_cameramaker_index = 22;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_GoPro: LibRaw_cameramaker_index = 23;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Hasselblad: LibRaw_cameramaker_index = 24;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_HTC: LibRaw_cameramaker_index = 25;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_I_Mobile: LibRaw_cameramaker_index = 26;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Imacon: LibRaw_cameramaker_index = 27;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_JK_Imaging: LibRaw_cameramaker_index = 28;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Kodak: LibRaw_cameramaker_index = 29;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Konica: LibRaw_cameramaker_index = 30;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Leaf: LibRaw_cameramaker_index = 31;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Leica: LibRaw_cameramaker_index = 32;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Lenovo: LibRaw_cameramaker_index = 33;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_LG: LibRaw_cameramaker_index = 34;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Logitech: LibRaw_cameramaker_index = 35;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Mamiya: LibRaw_cameramaker_index = 36;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Matrix: LibRaw_cameramaker_index = 37;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Meizu: LibRaw_cameramaker_index = 38;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Micron: LibRaw_cameramaker_index = 39;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Minolta: LibRaw_cameramaker_index = 40;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Motorola: LibRaw_cameramaker_index = 41;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_NGM: LibRaw_cameramaker_index = 42;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Nikon: LibRaw_cameramaker_index = 43;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Nokia: LibRaw_cameramaker_index = 44;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Olympus: LibRaw_cameramaker_index = 45;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_OmniVison: LibRaw_cameramaker_index = 46;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Panasonic: LibRaw_cameramaker_index = 47;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Parrot: LibRaw_cameramaker_index = 48;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Pentax: LibRaw_cameramaker_index = 49;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_PhaseOne: LibRaw_cameramaker_index = 50;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_PhotoControl: LibRaw_cameramaker_index = 51;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Photron: LibRaw_cameramaker_index = 52;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Pixelink: LibRaw_cameramaker_index = 53;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Polaroid: LibRaw_cameramaker_index = 54;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_RED: LibRaw_cameramaker_index = 55;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Ricoh: LibRaw_cameramaker_index = 56;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Rollei: LibRaw_cameramaker_index = 57;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_RoverShot: LibRaw_cameramaker_index = 58;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Samsung: LibRaw_cameramaker_index = 59;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Sigma: LibRaw_cameramaker_index = 60;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Sinar: LibRaw_cameramaker_index = 61;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_SMaL: LibRaw_cameramaker_index = 62;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Sony: LibRaw_cameramaker_index = 63;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_ST_Micro: LibRaw_cameramaker_index = 64;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_THL: LibRaw_cameramaker_index = 65;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_VLUU: LibRaw_cameramaker_index = 66;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Xiaomi: LibRaw_cameramaker_index = 67;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_XIAOYI: LibRaw_cameramaker_index = 68;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_YI: LibRaw_cameramaker_index = 69;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Yuneec: LibRaw_cameramaker_index = 70;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Zeiss: LibRaw_cameramaker_index = 71;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_OnePlus: LibRaw_cameramaker_index = 72;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_ISG: LibRaw_cameramaker_index = 73;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_VIVO: LibRaw_cameramaker_index = 74;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_HMD_Global: LibRaw_cameramaker_index = 75;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_HUAWEI: LibRaw_cameramaker_index = 76;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_RaspberryPi: LibRaw_cameramaker_index = 77;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_OmDigital: LibRaw_cameramaker_index = 78;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_TheLastOne: LibRaw_cameramaker_index = 79;
pub type LibRaw_cameramaker_index = libc::c_uint;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Unknown: LibRaw_camera_mounts = 0;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Alpa: LibRaw_camera_mounts = 1;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_C: LibRaw_camera_mounts = 2;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_EF_M: LibRaw_camera_mounts = 3;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_EF_S: LibRaw_camera_mounts = 4;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_EF: LibRaw_camera_mounts = 5;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_RF: LibRaw_camera_mounts = 6;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Contax_N: LibRaw_camera_mounts = 7;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Contax645: LibRaw_camera_mounts = 8;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_FT: LibRaw_camera_mounts = 9;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_mFT: LibRaw_camera_mounts = 10;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Fuji_GF: LibRaw_camera_mounts = 11;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Fuji_GX: LibRaw_camera_mounts = 12;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Fuji_X: LibRaw_camera_mounts = 13;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Hasselblad_H: LibRaw_camera_mounts = 14;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Hasselblad_V: LibRaw_camera_mounts = 15;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Hasselblad_XCD: LibRaw_camera_mounts = 16;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_M: LibRaw_camera_mounts = 17;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_R: LibRaw_camera_mounts = 18;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_S: LibRaw_camera_mounts = 19;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_SL: LibRaw_camera_mounts = 20;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_TL: LibRaw_camera_mounts = 21;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_LPS_L: LibRaw_camera_mounts = 22;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Mamiya67: LibRaw_camera_mounts = 23;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Mamiya645: LibRaw_camera_mounts = 24;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Minolta_A: LibRaw_camera_mounts = 25;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Nikon_CX: LibRaw_camera_mounts = 26;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Nikon_F: LibRaw_camera_mounts = 27;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Nikon_Z: LibRaw_camera_mounts = 28;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_PhaseOne_iXM_MV: LibRaw_camera_mounts = 29;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_PhaseOne_iXM_RS: LibRaw_camera_mounts = 30;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_PhaseOne_iXM: LibRaw_camera_mounts = 31;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Pentax_645: LibRaw_camera_mounts = 32;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Pentax_K: LibRaw_camera_mounts = 33;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Pentax_Q: LibRaw_camera_mounts = 34;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_RicohModule: LibRaw_camera_mounts = 35;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Rollei_bayonet: LibRaw_camera_mounts = 36;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Samsung_NX_M: LibRaw_camera_mounts = 37;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Samsung_NX: LibRaw_camera_mounts = 38;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Sigma_X3F: LibRaw_camera_mounts = 39;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Sony_E: LibRaw_camera_mounts = 40;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_LF: LibRaw_camera_mounts = 41;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_DigitalBack: LibRaw_camera_mounts = 42;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_FixedLens: LibRaw_camera_mounts = 43;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_IL_UM: LibRaw_camera_mounts = 44;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_TheLastOne: LibRaw_camera_mounts = 45;
pub type LibRaw_camera_mounts = libc::c_uint;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_Unknown: LibRaw_camera_formats = 0;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_APSC: LibRaw_camera_formats = 1;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_FF: LibRaw_camera_formats = 2;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_MF: LibRaw_camera_formats = 3;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_APSH: LibRaw_camera_formats = 4;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_1INCH: LibRaw_camera_formats = 5;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_1div2p3INCH: LibRaw_camera_formats = 6;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_1div1p7INCH: LibRaw_camera_formats = 7;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_FT: LibRaw_camera_formats = 8;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_CROP645: LibRaw_camera_formats = 9;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_LeicaS: LibRaw_camera_formats = 10;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_645: LibRaw_camera_formats = 11;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_66: LibRaw_camera_formats = 12;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_69: LibRaw_camera_formats = 13;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_LF: LibRaw_camera_formats = 14;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_Leica_DMR: LibRaw_camera_formats = 15;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_67: LibRaw_camera_formats = 16;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_SigmaAPSC: LibRaw_camera_formats = 17;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_SigmaMerrill: LibRaw_camera_formats = 18;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_SigmaAPSH: LibRaw_camera_formats = 19;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_3648: LibRaw_camera_formats = 20;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_68: LibRaw_camera_formats = 21;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_TheLastOne: LibRaw_camera_formats = 22;
pub type LibRaw_camera_formats = libc::c_uint;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_UNKNOWN: LibRawImageAspects = 0;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_OTHER: LibRawImageAspects = 1;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_MINIMAL_REAL_ASPECT_VALUE: LibRawImageAspects = 99;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_MAXIMAL_REAL_ASPECT_VALUE: LibRawImageAspects =
    10000;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_3to2: LibRawImageAspects = 1500;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_1to1: LibRawImageAspects = 1000;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_4to3: LibRawImageAspects = 1333;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_16to9: LibRawImageAspects = 1777;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_5to4: LibRawImageAspects = 1250;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_7to6: LibRawImageAspects = 1166;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_6to5: LibRawImageAspects = 1200;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_7to5: LibRawImageAspects = 1400;
pub type LibRawImageAspects = libc::c_uint;
pub const LibRaw_lens_focal_types_LIBRAW_FT_UNDEFINED: LibRaw_lens_focal_types = 0;
pub const LibRaw_lens_focal_types_LIBRAW_FT_PRIME_LENS: LibRaw_lens_focal_types = 1;
pub const LibRaw_lens_focal_types_LIBRAW_FT_ZOOM_LENS: LibRaw_lens_focal_types = 2;
pub const LibRaw_lens_focal_types_LIBRAW_FT_ZOOM_LENS_CONSTANT_APERTURE: LibRaw_lens_focal_types =
    3;
pub const LibRaw_lens_focal_types_LIBRAW_FT_ZOOM_LENS_VARIABLE_APERTURE: LibRaw_lens_focal_types =
    4;
pub type LibRaw_lens_focal_types = libc::c_uint;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_UNDEFINED: LibRaw_Canon_RecordModes = 0;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_JPEG: LibRaw_Canon_RecordModes = 1;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CRW_THM: LibRaw_Canon_RecordModes = 2;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_AVI_THM: LibRaw_Canon_RecordModes = 3;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_TIF: LibRaw_Canon_RecordModes = 4;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_TIF_JPEG: LibRaw_Canon_RecordModes = 5;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR2: LibRaw_Canon_RecordModes = 6;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR2_JPEG: LibRaw_Canon_RecordModes = 7;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_UNKNOWN: LibRaw_Canon_RecordModes = 8;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_MOV: LibRaw_Canon_RecordModes = 9;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_MP4: LibRaw_Canon_RecordModes = 10;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CRM: LibRaw_Canon_RecordModes = 11;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR3: LibRaw_Canon_RecordModes = 12;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR3_JPEG: LibRaw_Canon_RecordModes = 13;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_HEIF: LibRaw_Canon_RecordModes = 14;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR3_HEIF: LibRaw_Canon_RecordModes = 15;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_TheLastOne: LibRaw_Canon_RecordModes =
    16;
pub type LibRaw_Canon_RecordModes = libc::c_uint;
pub const LibRaw_minolta_storagemethods_LIBRAW_MINOLTA_UNPACKED: LibRaw_minolta_storagemethods = 82;
pub const LibRaw_minolta_storagemethods_LIBRAW_MINOLTA_PACKED: LibRaw_minolta_storagemethods = 89;
pub type LibRaw_minolta_storagemethods = libc::c_uint;
pub const LibRaw_minolta_bayerpatterns_LIBRAW_MINOLTA_RGGB: LibRaw_minolta_bayerpatterns = 1;
pub const LibRaw_minolta_bayerpatterns_LIBRAW_MINOLTA_G2BRG1: LibRaw_minolta_bayerpatterns = 4;
pub type LibRaw_minolta_bayerpatterns = libc::c_uint;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_DSC: LibRaw_sony_cameratypes = 1;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_DSLR: LibRaw_sony_cameratypes = 2;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_NEX: LibRaw_sony_cameratypes = 3;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_SLT: LibRaw_sony_cameratypes = 4;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_ILCE: LibRaw_sony_cameratypes = 5;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_ILCA: LibRaw_sony_cameratypes = 6;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_CameraType_UNKNOWN: LibRaw_sony_cameratypes = 65535;
pub type LibRaw_sony_cameratypes = libc::c_uint;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010None: LibRaw_Sony_0x2010_Type = 0;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010a: LibRaw_Sony_0x2010_Type = 1;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010b: LibRaw_Sony_0x2010_Type = 2;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010c: LibRaw_Sony_0x2010_Type = 3;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010d: LibRaw_Sony_0x2010_Type = 4;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010e: LibRaw_Sony_0x2010_Type = 5;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010f: LibRaw_Sony_0x2010_Type = 6;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010g: LibRaw_Sony_0x2010_Type = 7;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010h: LibRaw_Sony_0x2010_Type = 8;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010i: LibRaw_Sony_0x2010_Type = 9;
pub type LibRaw_Sony_0x2010_Type = libc::c_uint;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050None: LibRaw_Sony_0x9050_Type = 0;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050a: LibRaw_Sony_0x9050_Type = 1;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050b: LibRaw_Sony_0x9050_Type = 2;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050c: LibRaw_Sony_0x9050_Type = 3;
pub type LibRaw_Sony_0x9050_Type = libc::c_uint;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_MF: LIBRAW_SONY_FOCUSMODEmodes = 0;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_S: LIBRAW_SONY_FOCUSMODEmodes = 2;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_C: LIBRAW_SONY_FOCUSMODEmodes = 3;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_A: LIBRAW_SONY_FOCUSMODEmodes = 4;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_DMF: LIBRAW_SONY_FOCUSMODEmodes = 6;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_D: LIBRAW_SONY_FOCUSMODEmodes = 7;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF: LIBRAW_SONY_FOCUSMODEmodes = 101;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_PERMANENT_AF:
    LIBRAW_SONY_FOCUSMODEmodes = 104;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_SEMI_MF: LIBRAW_SONY_FOCUSMODEmodes =
    105;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_UNKNOWN: LIBRAW_SONY_FOCUSMODEmodes = -1;
pub type LIBRAW_SONY_FOCUSMODEmodes = libc::c_int;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_UnknownSensor: LibRaw_KodakSensors = 0;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M1: LibRaw_KodakSensors = 1;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M15: LibRaw_KodakSensors = 2;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M16: LibRaw_KodakSensors = 3;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M17: LibRaw_KodakSensors = 4;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M2: LibRaw_KodakSensors = 5;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M23: LibRaw_KodakSensors = 6;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M24: LibRaw_KodakSensors = 7;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M3: LibRaw_KodakSensors = 8;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M5: LibRaw_KodakSensors = 9;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M6: LibRaw_KodakSensors = 10;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_C14: LibRaw_KodakSensors = 11;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_X14: LibRaw_KodakSensors = 12;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M11: LibRaw_KodakSensors = 13;
pub type LibRaw_KodakSensors = libc::c_uint;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_Unknown: LibRaw_HasselbladFormatCodes = 0;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_3FR: LibRaw_HasselbladFormatCodes = 1;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_FFF: LibRaw_HasselbladFormatCodes = 2;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_Imacon: LibRaw_HasselbladFormatCodes = 3;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_HasselbladDNG: LibRaw_HasselbladFormatCodes = 4;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_AdobeDNG: LibRaw_HasselbladFormatCodes = 5;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_AdobeDNG_fromPhocusDNG:
    LibRaw_HasselbladFormatCodes = 6;
pub type LibRaw_HasselbladFormatCodes = libc::c_uint;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_NONE: LibRaw_rawspecial_t = 0;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_BASEONLY: LibRaw_rawspecial_t = 1;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_DELTAONLY: LibRaw_rawspecial_t = 2;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_DELTAZEROBASE: LibRaw_rawspecial_t = 4;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_DELTATOVALUE: LibRaw_rawspecial_t = 8;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_ALLFLAGS: LibRaw_rawspecial_t = 15;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_NODP2Q_INTERPOLATERG: LibRaw_rawspecial_t = 16;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_NODP2Q_INTERPOLATEAF: LibRaw_rawspecial_t = 32;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SRAW_NO_RGB: LibRaw_rawspecial_t = 64;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SRAW_NO_INTERPOLATE: LibRaw_rawspecial_t = 128;
pub type LibRaw_rawspecial_t = libc::c_uint;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV1_USE: LibRaw_rawspeed_bits_t = 1;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV1_FAILONUNKNOWN: LibRaw_rawspeed_bits_t = 2;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV1_IGNOREERRORS: LibRaw_rawspeed_bits_t = 4;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV3_USE: LibRaw_rawspeed_bits_t = 256;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV3_FAILONUNKNOWN: LibRaw_rawspeed_bits_t = 512;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV3_IGNOREERRORS: LibRaw_rawspeed_bits_t = 1024;
pub type LibRaw_rawspeed_bits_t = libc::c_uint;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_PENTAX_PS_ALLFRAMES:
    LibRaw_processing_options = 1;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CONVERTFLOAT_TO_INT:
    LibRaw_processing_options = 2;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_ARQ_SKIP_CHANNEL_SWAP:
    LibRaw_processing_options = 4;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_NO_ROTATE_FOR_KODAK_THUMBNAILS:
    LibRaw_processing_options = 8;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_USE_PPM16_THUMBS: LibRaw_processing_options =
    32;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DONT_CHECK_DNG_ILLUMINANT:
    LibRaw_processing_options = 64;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNGSDK_ZEROCOPY: LibRaw_processing_options =
    128;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_ZEROFILTERS_FOR_MONOCHROMETIFFS:
    LibRaw_processing_options = 256;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ADD_ENHANCED: LibRaw_processing_options =
    512;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ADD_PREVIEWS: LibRaw_processing_options =
    1024;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_PREFER_LARGEST_IMAGE:
    LibRaw_processing_options = 2048;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE2: LibRaw_processing_options = 4096;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE3: LibRaw_processing_options = 8192;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ALLOWSIZECHANGE:
    LibRaw_processing_options = 16384;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_DISABLEWBADJUST:
    LibRaw_processing_options = 32768;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_PROVIDE_NONSTANDARD_WB:
    LibRaw_processing_options = 65536;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CAMERAWB_FALLBACK_TO_DAYLIGHT:
    LibRaw_processing_options = 131072;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CHECK_THUMBNAILS_KNOWN_VENDORS:
    LibRaw_processing_options = 262144;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CHECK_THUMBNAILS_ALL_VENDORS:
    LibRaw_processing_options = 524288;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE2_IFPRESENT:
    LibRaw_processing_options = 1048576;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE3_IFPRESENT:
    LibRaw_processing_options = 2097152;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ADD_MASKS: LibRaw_processing_options =
    4194304;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CANON_IGNORE_MAKERNOTES_ROTATION:
    LibRaw_processing_options = 8388608;
pub type LibRaw_processing_options = libc::c_uint;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_HASCURVE: LibRaw_decoder_flags = 16;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_SONYARW2: LibRaw_decoder_flags = 32;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_TRYRAWSPEED: LibRaw_decoder_flags = 64;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_OWNALLOC: LibRaw_decoder_flags = 128;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_FIXEDMAXC: LibRaw_decoder_flags = 256;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_ADOBECOPYPIXEL: LibRaw_decoder_flags = 512;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_LEGACY_WITH_MARGINS: LibRaw_decoder_flags = 1024;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_3CHANNEL: LibRaw_decoder_flags = 2048;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_SINAR4SHOT: LibRaw_decoder_flags = 2048;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_FLATDATA: LibRaw_decoder_flags = 4096;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_FLAT_BG2_SWAPPED: LibRaw_decoder_flags = 8192;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_UNSUPPORTED_FORMAT: LibRaw_decoder_flags = 16384;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_NOTSET: LibRaw_decoder_flags = 32768;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_TRYRAWSPEED3: LibRaw_decoder_flags = 65536;
pub type LibRaw_decoder_flags = libc::c_uint;
pub const LibRaw_constructor_flags_LIBRAW_OPTIONS_NONE: LibRaw_constructor_flags = 0;
pub const LibRaw_constructor_flags_LIBRAW_OPTIONS_NO_DATAERR_CALLBACK: LibRaw_constructor_flags = 2;
pub const LibRaw_constructor_flags_LIBRAW_OPIONS_NO_DATAERR_CALLBACK: LibRaw_constructor_flags = 2;
pub type LibRaw_constructor_flags = libc::c_uint;
pub const LibRaw_warnings_LIBRAW_WARN_NONE: LibRaw_warnings = 0;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_CAMERA_WB: LibRaw_warnings = 4;
pub const LibRaw_warnings_LIBRAW_WARN_NO_METADATA: LibRaw_warnings = 8;
pub const LibRaw_warnings_LIBRAW_WARN_NO_JPEGLIB: LibRaw_warnings = 16;
pub const LibRaw_warnings_LIBRAW_WARN_NO_EMBEDDED_PROFILE: LibRaw_warnings = 32;
pub const LibRaw_warnings_LIBRAW_WARN_NO_INPUT_PROFILE: LibRaw_warnings = 64;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_OUTPUT_PROFILE: LibRaw_warnings = 128;
pub const LibRaw_warnings_LIBRAW_WARN_NO_BADPIXELMAP: LibRaw_warnings = 256;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_DARKFRAME_FILE: LibRaw_warnings = 512;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_DARKFRAME_DIM: LibRaw_warnings = 1024;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED_PROBLEM: LibRaw_warnings = 4096;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED_UNSUPPORTED: LibRaw_warnings = 8192;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED_PROCESSED: LibRaw_warnings = 16384;
pub const LibRaw_warnings_LIBRAW_WARN_FALLBACK_TO_AHD: LibRaw_warnings = 32768;
pub const LibRaw_warnings_LIBRAW_WARN_PARSEFUJI_PROCESSED: LibRaw_warnings = 65536;
pub const LibRaw_warnings_LIBRAW_WARN_DNGSDK_PROCESSED: LibRaw_warnings = 131072;
pub const LibRaw_warnings_LIBRAW_WARN_DNG_IMAGES_REORDERED: LibRaw_warnings = 262144;
pub const LibRaw_warnings_LIBRAW_WARN_DNG_STAGE2_APPLIED: LibRaw_warnings = 524288;
pub const LibRaw_warnings_LIBRAW_WARN_DNG_STAGE3_APPLIED: LibRaw_warnings = 1048576;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_PROBLEM: LibRaw_warnings = 2097152;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_UNSUPPORTED: LibRaw_warnings = 4194304;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_PROCESSED: LibRaw_warnings = 8388608;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_NOTLISTED: LibRaw_warnings = 16777216;
pub type LibRaw_warnings = libc::c_uint;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_NONE: LibRaw_exceptions = 0;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_ALLOC: LibRaw_exceptions = 1;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_DECODE_RAW: LibRaw_exceptions = 2;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_DECODE_JPEG: LibRaw_exceptions = 3;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_IO_EOF: LibRaw_exceptions = 4;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_IO_CORRUPT: LibRaw_exceptions = 5;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_CANCELLED_BY_CALLBACK: LibRaw_exceptions = 6;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_BAD_CROP: LibRaw_exceptions = 7;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_IO_BADFILE: LibRaw_exceptions = 8;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_DECODE_JPEG2000: LibRaw_exceptions = 9;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_TOOBIG: LibRaw_exceptions = 10;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_MEMPOOL: LibRaw_exceptions = 11;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_UNSUPPORTED_FORMAT: LibRaw_exceptions = 12;
pub type LibRaw_exceptions = libc::c_uint;
pub const LibRaw_progress_LIBRAW_PROGRESS_START: LibRaw_progress = 0;
pub const LibRaw_progress_LIBRAW_PROGRESS_OPEN: LibRaw_progress = 1;
pub const LibRaw_progress_LIBRAW_PROGRESS_IDENTIFY: LibRaw_progress = 2;
pub const LibRaw_progress_LIBRAW_PROGRESS_SIZE_ADJUST: LibRaw_progress = 4;
pub const LibRaw_progress_LIBRAW_PROGRESS_LOAD_RAW: LibRaw_progress = 8;
pub const LibRaw_progress_LIBRAW_PROGRESS_RAW2_IMAGE: LibRaw_progress = 16;
pub const LibRaw_progress_LIBRAW_PROGRESS_REMOVE_ZEROES: LibRaw_progress = 32;
pub const LibRaw_progress_LIBRAW_PROGRESS_BAD_PIXELS: LibRaw_progress = 64;
pub const LibRaw_progress_LIBRAW_PROGRESS_DARK_FRAME: LibRaw_progress = 128;
pub const LibRaw_progress_LIBRAW_PROGRESS_FOVEON_INTERPOLATE: LibRaw_progress = 256;
pub const LibRaw_progress_LIBRAW_PROGRESS_SCALE_COLORS: LibRaw_progress = 512;
pub const LibRaw_progress_LIBRAW_PROGRESS_PRE_INTERPOLATE: LibRaw_progress = 1024;
pub const LibRaw_progress_LIBRAW_PROGRESS_INTERPOLATE: LibRaw_progress = 2048;
pub const LibRaw_progress_LIBRAW_PROGRESS_MIX_GREEN: LibRaw_progress = 4096;
pub const LibRaw_progress_LIBRAW_PROGRESS_MEDIAN_FILTER: LibRaw_progress = 8192;
pub const LibRaw_progress_LIBRAW_PROGRESS_HIGHLIGHTS: LibRaw_progress = 16384;
pub const LibRaw_progress_LIBRAW_PROGRESS_FUJI_ROTATE: LibRaw_progress = 32768;
pub const LibRaw_progress_LIBRAW_PROGRESS_FLIP: LibRaw_progress = 65536;
pub const LibRaw_progress_LIBRAW_PROGRESS_APPLY_PROFILE: LibRaw_progress = 131072;
pub const LibRaw_progress_LIBRAW_PROGRESS_CONVERT_RGB: LibRaw_progress = 262144;
pub const LibRaw_progress_LIBRAW_PROGRESS_STRETCH: LibRaw_progress = 524288;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE20: LibRaw_progress = 1048576;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE21: LibRaw_progress = 2097152;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE22: LibRaw_progress = 4194304;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE23: LibRaw_progress = 8388608;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE24: LibRaw_progress = 16777216;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE25: LibRaw_progress = 33554432;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE26: LibRaw_progress = 67108864;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE27: LibRaw_progress = 134217728;
pub const LibRaw_progress_LIBRAW_PROGRESS_THUMB_LOAD: LibRaw_progress = 268435456;
pub const LibRaw_progress_LIBRAW_PROGRESS_TRESERVED1: LibRaw_progress = 536870912;
pub const LibRaw_progress_LIBRAW_PROGRESS_TRESERVED2: LibRaw_progress = 1073741824;
pub type LibRaw_progress = libc::c_uint;
pub const LibRaw_errors_LIBRAW_SUCCESS: LibRaw_errors = 0;
pub const LibRaw_errors_LIBRAW_UNSPECIFIED_ERROR: LibRaw_errors = -1;
pub const LibRaw_errors_LIBRAW_FILE_UNSUPPORTED: LibRaw_errors = -2;
pub const LibRaw_errors_LIBRAW_REQUEST_FOR_NONEXISTENT_IMAGE: LibRaw_errors = -3;
pub const LibRaw_errors_LIBRAW_OUT_OF_ORDER_CALL: LibRaw_errors = -4;
pub const LibRaw_errors_LIBRAW_NO_THUMBNAIL: LibRaw_errors = -5;
pub const LibRaw_errors_LIBRAW_UNSUPPORTED_THUMBNAIL: LibRaw_errors = -6;
pub const LibRaw_errors_LIBRAW_INPUT_CLOSED: LibRaw_errors = -7;
pub const LibRaw_errors_LIBRAW_NOT_IMPLEMENTED: LibRaw_errors = -8;
pub const LibRaw_errors_LIBRAW_REQUEST_FOR_NONEXISTENT_THUMBNAIL: LibRaw_errors = -9;
pub const LibRaw_errors_LIBRAW_UNSUFFICIENT_MEMORY: LibRaw_errors = -100007;
pub const LibRaw_errors_LIBRAW_DATA_ERROR: LibRaw_errors = -100008;
pub const LibRaw_errors_LIBRAW_IO_ERROR: LibRaw_errors = -100009;
pub const LibRaw_errors_LIBRAW_CANCELLED_BY_CALLBACK: LibRaw_errors = -100010;
pub const LibRaw_errors_LIBRAW_BAD_CROP: LibRaw_errors = -100011;
pub const LibRaw_errors_LIBRAW_TOO_BIG: LibRaw_errors = -100012;
pub const LibRaw_errors_LIBRAW_MEMPOOL_OVERFLOW: LibRaw_errors = -100013;
pub type LibRaw_errors = libc::c_int;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_UNKNOWN:
    LibRaw_internal_thumbnail_formats = 0;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_THUMB:
    LibRaw_internal_thumbnail_formats = 1;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_YCBCR:
    LibRaw_internal_thumbnail_formats = 2;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_RGB:
    LibRaw_internal_thumbnail_formats = 3;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_JPEG:
    LibRaw_internal_thumbnail_formats = 4;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_LAYER:
    LibRaw_internal_thumbnail_formats = 5;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_ROLLEI:
    LibRaw_internal_thumbnail_formats = 6;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_PPM:
    LibRaw_internal_thumbnail_formats = 7;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_PPM16:
    LibRaw_internal_thumbnail_formats = 8;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_X3F:
    LibRaw_internal_thumbnail_formats = 9;
pub type LibRaw_internal_thumbnail_formats = libc::c_uint;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_UNKNOWN: LibRaw_thumbnail_formats = 0;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_JPEG: LibRaw_thumbnail_formats = 1;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_BITMAP: LibRaw_thumbnail_formats = 2;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_BITMAP16: LibRaw_thumbnail_formats = 3;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_LAYER: LibRaw_thumbnail_formats = 4;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_ROLLEI: LibRaw_thumbnail_formats = 5;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_H265: LibRaw_thumbnail_formats = 6;
pub type LibRaw_thumbnail_formats = libc::c_uint;
pub const LibRaw_image_formats_LIBRAW_IMAGE_JPEG: LibRaw_image_formats = 1;
pub const LibRaw_image_formats_LIBRAW_IMAGE_BITMAP: LibRaw_image_formats = 2;
pub type LibRaw_image_formats = libc::c_uint;
pub type INT64 = libc::c_longlong;
pub type UINT64 = libc::c_ulonglong;
pub type uchar = libc::c_uchar;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_decoder_info_t {
    pub decoder_name: *const libc::c_char,
    pub decoder_flags: libc::c_uint,
}
#[test]
fn bindgen_test_layout_libraw_decoder_info_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_decoder_info_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_decoder_info_t>(),
        16usize,
        concat!("Size of: ", stringify!(libraw_decoder_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_decoder_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_decoder_info_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).decoder_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_decoder_info_t),
            "::",
            stringify!(decoder_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).decoder_flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_decoder_info_t),
            "::",
            stringify!(decoder_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_internal_output_params_t {
    pub mix_green: libc::c_uint,
    pub raw_color: libc::c_uint,
    pub zero_is_bad: libc::c_uint,
    pub shrink: ushort,
    pub fuji_width: ushort,
}
#[test]
fn bindgen_test_layout_libraw_internal_output_params_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_internal_output_params_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_internal_output_params_t>(),
        16usize,
        concat!("Size of: ", stringify!(libraw_internal_output_params_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_internal_output_params_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_internal_output_params_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mix_green) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_internal_output_params_t),
            "::",
            stringify!(mix_green)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw_color) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_internal_output_params_t),
            "::",
            stringify!(raw_color)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).zero_is_bad) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_internal_output_params_t),
            "::",
            stringify!(zero_is_bad)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).shrink) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_internal_output_params_t),
            "::",
            stringify!(shrink)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fuji_width) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_internal_output_params_t),
            "::",
            stringify!(fuji_width)
        )
    );
}
pub type memory_callback = ::core::option::Option<
    unsafe extern "C" fn(
        data: *mut libc::c_void,
        file: *const libc::c_char,
        where_: *const libc::c_char,
    ),
>;
pub type exif_parser_callback = ::core::option::Option<
    unsafe extern "C" fn(
        context: *mut libc::c_void,
        tag: libc::c_int,
        type_: libc::c_int,
        len: libc::c_int,
        ord: libc::c_uint,
        ifp: *mut libc::c_void,
        base: INT64,
    ),
>;
pub type data_callback = ::core::option::Option<
    unsafe extern "C" fn(data: *mut libc::c_void, file: *const libc::c_char, offset: libc::c_int),
>;
extern "C" {
    pub fn default_data_callback(
        data: *mut libc::c_void,
        file: *const libc::c_char,
        offset: libc::c_int,
    );
}
pub type progress_callback = ::core::option::Option<
    unsafe extern "C" fn(
        data: *mut libc::c_void,
        stage: LibRaw_progress,
        iteration: libc::c_int,
        expected: libc::c_int,
    ) -> libc::c_int,
>;
pub type pre_identify_callback =
    ::core::option::Option<unsafe extern "C" fn(ctx: *mut libc::c_void) -> libc::c_int>;
pub type post_identify_callback =
    ::core::option::Option<unsafe extern "C" fn(ctx: *mut libc::c_void)>;
pub type process_step_callback =
    ::core::option::Option<unsafe extern "C" fn(ctx: *mut libc::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_callbacks_t {
    pub data_cb: data_callback,
    pub datacb_data: *mut libc::c_void,
    pub progress_cb: progress_callback,
    pub progresscb_data: *mut libc::c_void,
    pub exif_cb: exif_parser_callback,
    pub exifparser_data: *mut libc::c_void,
    pub pre_identify_cb: pre_identify_callback,
    pub post_identify_cb: post_identify_callback,
    pub pre_subtractblack_cb: process_step_callback,
    pub pre_scalecolors_cb: process_step_callback,
    pub pre_preinterpolate_cb: process_step_callback,
    pub pre_interpolate_cb: process_step_callback,
    pub interpolate_bayer_cb: process_step_callback,
    pub interpolate_xtrans_cb: process_step_callback,
    pub post_interpolate_cb: process_step_callback,
    pub pre_converttorgb_cb: process_step_callback,
    pub post_converttorgb_cb: process_step_callback,
}
#[test]
fn bindgen_test_layout_libraw_callbacks_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_callbacks_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_callbacks_t>(),
        136usize,
        concat!("Size of: ", stringify!(libraw_callbacks_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_callbacks_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_callbacks_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_cb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(data_cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).datacb_data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(datacb_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).progress_cb) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(progress_cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).progresscb_data) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(progresscb_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).exif_cb) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(exif_cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).exifparser_data) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(exifparser_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pre_identify_cb) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(pre_identify_cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).post_identify_cb) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(post_identify_cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pre_subtractblack_cb) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(pre_subtractblack_cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pre_scalecolors_cb) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(pre_scalecolors_cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pre_preinterpolate_cb) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(pre_preinterpolate_cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pre_interpolate_cb) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(pre_interpolate_cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).interpolate_bayer_cb) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(interpolate_bayer_cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).interpolate_xtrans_cb) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(interpolate_xtrans_cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).post_interpolate_cb) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(post_interpolate_cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pre_converttorgb_cb) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(pre_converttorgb_cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).post_converttorgb_cb) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(post_converttorgb_cb)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_processed_image_t {
    pub type_: LibRaw_image_formats,
    pub height: ushort,
    pub width: ushort,
    pub colors: ushort,
    pub bits: ushort,
    pub data_size: libc::c_uint,
    pub data: [libc::c_uchar; 1usize],
}
#[test]
fn bindgen_test_layout_libraw_processed_image_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_processed_image_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_processed_image_t>(),
        20usize,
        concat!("Size of: ", stringify!(libraw_processed_image_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_processed_image_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_processed_image_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).colors) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(colors)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bits) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_size) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(data_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_iparams_t {
    pub guard: [libc::c_char; 4usize],
    pub make: [libc::c_char; 64usize],
    pub model: [libc::c_char; 64usize],
    pub software: [libc::c_char; 64usize],
    pub normalized_make: [libc::c_char; 64usize],
    pub normalized_model: [libc::c_char; 64usize],
    pub maker_index: libc::c_uint,
    pub raw_count: libc::c_uint,
    pub dng_version: libc::c_uint,
    pub is_foveon: libc::c_uint,
    pub colors: libc::c_int,
    pub filters: libc::c_uint,
    pub xtrans: [[libc::c_char; 6usize]; 6usize],
    pub xtrans_abs: [[libc::c_char; 6usize]; 6usize],
    pub cdesc: [libc::c_char; 5usize],
    pub xmplen: libc::c_uint,
    pub xmpdata: *mut libc::c_char,
}
#[test]
fn bindgen_test_layout_libraw_iparams_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_iparams_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_iparams_t>(),
        440usize,
        concat!("Size of: ", stringify!(libraw_iparams_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_iparams_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_iparams_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).guard) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(guard)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).make) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(make)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).model) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).software) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(software)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).normalized_make) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(normalized_make)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).normalized_model) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(normalized_model)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).maker_index) as usize - ptr as usize },
        324usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(maker_index)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw_count) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(raw_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dng_version) as usize - ptr as usize },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(dng_version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_foveon) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(is_foveon)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).colors) as usize - ptr as usize },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(colors)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).filters) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(filters)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xtrans) as usize - ptr as usize },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(xtrans)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xtrans_abs) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(xtrans_abs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cdesc) as usize - ptr as usize },
        420usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(cdesc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xmplen) as usize - ptr as usize },
        428usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(xmplen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xmpdata) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(xmpdata)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_raw_inset_crop_t {
    pub cleft: ushort,
    pub ctop: ushort,
    pub cwidth: ushort,
    pub cheight: ushort,
}
#[test]
fn bindgen_test_layout_libraw_raw_inset_crop_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_raw_inset_crop_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_raw_inset_crop_t>(),
        8usize,
        concat!("Size of: ", stringify!(libraw_raw_inset_crop_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_raw_inset_crop_t>(),
        2usize,
        concat!("Alignment of ", stringify!(libraw_raw_inset_crop_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cleft) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_raw_inset_crop_t),
            "::",
            stringify!(cleft)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ctop) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_raw_inset_crop_t),
            "::",
            stringify!(ctop)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cwidth) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_raw_inset_crop_t),
            "::",
            stringify!(cwidth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cheight) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_raw_inset_crop_t),
            "::",
            stringify!(cheight)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_image_sizes_t {
    pub raw_height: ushort,
    pub raw_width: ushort,
    pub height: ushort,
    pub width: ushort,
    pub top_margin: ushort,
    pub left_margin: ushort,
    pub iheight: ushort,
    pub iwidth: ushort,
    pub raw_pitch: libc::c_uint,
    pub pixel_aspect: f64,
    pub flip: libc::c_int,
    pub mask: [[libc::c_int; 4usize]; 8usize],
    pub raw_aspect: ushort,
    pub raw_inset_crops: [libraw_raw_inset_crop_t; 2usize],
}
#[test]
fn bindgen_test_layout_libraw_image_sizes_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_image_sizes_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_image_sizes_t>(),
        184usize,
        concat!("Size of: ", stringify!(libraw_image_sizes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_image_sizes_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_image_sizes_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw_height) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(raw_height)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw_width) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(raw_width)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).top_margin) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(top_margin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).left_margin) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(left_margin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iheight) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(iheight)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iwidth) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(iwidth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw_pitch) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(raw_pitch)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pixel_aspect) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(pixel_aspect)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flip) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(flip)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mask) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw_aspect) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(raw_aspect)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw_inset_crops) as usize - ptr as usize },
        166usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(raw_inset_crops)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_area_t {
    pub t: libc::c_short,
    pub l: libc::c_short,
    pub b: libc::c_short,
    pub r: libc::c_short,
}
#[test]
fn bindgen_test_layout_libraw_area_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_area_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_area_t>(),
        8usize,
        concat!("Size of: ", stringify!(libraw_area_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_area_t>(),
        2usize,
        concat!("Alignment of ", stringify!(libraw_area_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).t) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_area_t),
            "::",
            stringify!(t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_area_t),
            "::",
            stringify!(l)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_area_t),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_area_t),
            "::",
            stringify!(r)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct ph1_t {
    pub format: libc::c_int,
    pub key_off: libc::c_int,
    pub tag_21a: libc::c_int,
    pub t_black: libc::c_int,
    pub split_col: libc::c_int,
    pub black_col: libc::c_int,
    pub split_row: libc::c_int,
    pub black_row: libc::c_int,
    pub tag_210: f32,
}
#[test]
fn bindgen_test_layout_ph1_t() {
    const UNINIT: ::core::mem::MaybeUninit<ph1_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<ph1_t>(),
        36usize,
        concat!("Size of: ", stringify!(ph1_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ph1_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ph1_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key_off) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(key_off)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tag_21a) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(tag_21a)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).t_black) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(t_black)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).split_col) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(split_col)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).black_col) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(black_col)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).split_row) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(split_row)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).black_row) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(black_row)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tag_210) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(tag_210)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_dng_color_t {
    pub parsedfields: libc::c_uint,
    pub illuminant: ushort,
    pub calibration: [[f32; 4usize]; 4usize],
    pub colormatrix: [[f32; 3usize]; 4usize],
    pub forwardmatrix: [[f32; 4usize]; 3usize],
}
#[test]
fn bindgen_test_layout_libraw_dng_color_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_dng_color_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_dng_color_t>(),
        168usize,
        concat!("Size of: ", stringify!(libraw_dng_color_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_dng_color_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_dng_color_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).parsedfields) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_color_t),
            "::",
            stringify!(parsedfields)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).illuminant) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_color_t),
            "::",
            stringify!(illuminant)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).calibration) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_color_t),
            "::",
            stringify!(calibration)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).colormatrix) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_color_t),
            "::",
            stringify!(colormatrix)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).forwardmatrix) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_color_t),
            "::",
            stringify!(forwardmatrix)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_dng_levels_t {
    pub parsedfields: libc::c_uint,
    pub dng_cblack: [libc::c_uint; 4104usize],
    pub dng_black: libc::c_uint,
    pub dng_fcblack: [f32; 4104usize],
    pub dng_fblack: f32,
    pub dng_whitelevel: [libc::c_uint; 4usize],
    pub default_crop: [ushort; 4usize],
    pub user_crop: [f32; 4usize],
    pub preview_colorspace: libc::c_uint,
    pub analogbalance: [f32; 4usize],
    pub asshotneutral: [f32; 4usize],
    pub baseline_exposure: f32,
    pub LinearResponseLimit: f32,
}
#[test]
fn bindgen_test_layout_libraw_dng_levels_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_dng_levels_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_dng_levels_t>(),
        32928usize,
        concat!("Size of: ", stringify!(libraw_dng_levels_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_dng_levels_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_dng_levels_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).parsedfields) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(parsedfields)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dng_cblack) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(dng_cblack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dng_black) as usize - ptr as usize },
        16420usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(dng_black)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dng_fcblack) as usize - ptr as usize },
        16424usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(dng_fcblack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dng_fblack) as usize - ptr as usize },
        32840usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(dng_fblack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dng_whitelevel) as usize - ptr as usize },
        32844usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(dng_whitelevel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).default_crop) as usize - ptr as usize },
        32860usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(default_crop)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).user_crop) as usize - ptr as usize },
        32868usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(user_crop)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).preview_colorspace) as usize - ptr as usize },
        32884usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(preview_colorspace)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).analogbalance) as usize - ptr as usize },
        32888usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(analogbalance)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).asshotneutral) as usize - ptr as usize },
        32904usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(asshotneutral)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).baseline_exposure) as usize - ptr as usize },
        32920usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(baseline_exposure)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LinearResponseLimit) as usize - ptr as usize },
        32924usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(LinearResponseLimit)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_P1_color_t {
    pub romm_cam: [f32; 9usize],
}
#[test]
fn bindgen_test_layout_libraw_P1_color_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_P1_color_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_P1_color_t>(),
        36usize,
        concat!("Size of: ", stringify!(libraw_P1_color_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_P1_color_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_P1_color_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).romm_cam) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_P1_color_t),
            "::",
            stringify!(romm_cam)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_canon_makernotes_t {
    pub ColorDataVer: libc::c_int,
    pub ColorDataSubVer: libc::c_int,
    pub SpecularWhiteLevel: libc::c_int,
    pub NormalWhiteLevel: libc::c_int,
    pub ChannelBlackLevel: [libc::c_int; 4usize],
    pub AverageBlackLevel: libc::c_int,
    pub multishot: [libc::c_uint; 4usize],
    pub MeteringMode: libc::c_short,
    pub SpotMeteringMode: libc::c_short,
    pub FlashMeteringMode: uchar,
    pub FlashExposureLock: libc::c_short,
    pub ExposureMode: libc::c_short,
    pub AESetting: libc::c_short,
    pub ImageStabilization: libc::c_short,
    pub FlashMode: libc::c_short,
    pub FlashActivity: libc::c_short,
    pub FlashBits: libc::c_short,
    pub ManualFlashOutput: libc::c_short,
    pub FlashOutput: libc::c_short,
    pub FlashGuideNumber: libc::c_short,
    pub ContinuousDrive: libc::c_short,
    pub SensorWidth: libc::c_short,
    pub SensorHeight: libc::c_short,
    pub AFMicroAdjMode: libc::c_int,
    pub AFMicroAdjValue: f32,
    pub MakernotesFlip: libc::c_short,
    pub RecordMode: libc::c_short,
    pub SRAWQuality: libc::c_short,
    pub wbi: libc::c_uint,
    pub RF_lensID: libc::c_short,
    pub AutoLightingOptimizer: libc::c_int,
    pub HighlightTonePriority: libc::c_int,
    pub Quality: libc::c_short,
    pub CanonLog: libc::c_int,
    pub DefaultCropAbsolute: libraw_area_t,
    pub RecommendedImageArea: libraw_area_t,
    pub LeftOpticalBlack: libraw_area_t,
    pub UpperOpticalBlack: libraw_area_t,
    pub ActiveArea: libraw_area_t,
    pub ISOgain: [libc::c_short; 2usize],
}
#[test]
fn bindgen_test_layout_libraw_canon_makernotes_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_canon_makernotes_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_canon_makernotes_t>(),
        168usize,
        concat!("Size of: ", stringify!(libraw_canon_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_canon_makernotes_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_canon_makernotes_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ColorDataVer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ColorDataVer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ColorDataSubVer) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ColorDataSubVer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SpecularWhiteLevel) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(SpecularWhiteLevel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NormalWhiteLevel) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(NormalWhiteLevel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ChannelBlackLevel) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ChannelBlackLevel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AverageBlackLevel) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(AverageBlackLevel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).multishot) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(multishot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MeteringMode) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(MeteringMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SpotMeteringMode) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(SpotMeteringMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashMeteringMode) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashMeteringMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashExposureLock) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashExposureLock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ExposureMode) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ExposureMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AESetting) as usize - ptr as usize },
        62usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(AESetting)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ImageStabilization) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ImageStabilization)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashMode) as usize - ptr as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashActivity) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashActivity)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashBits) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashBits)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ManualFlashOutput) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ManualFlashOutput)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashOutput) as usize - ptr as usize },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashOutput)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashGuideNumber) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashGuideNumber)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ContinuousDrive) as usize - ptr as usize },
        78usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ContinuousDrive)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SensorWidth) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(SensorWidth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SensorHeight) as usize - ptr as usize },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(SensorHeight)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFMicroAdjMode) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(AFMicroAdjMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFMicroAdjValue) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(AFMicroAdjValue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MakernotesFlip) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(MakernotesFlip)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RecordMode) as usize - ptr as usize },
        94usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(RecordMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SRAWQuality) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(SRAWQuality)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wbi) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(wbi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RF_lensID) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(RF_lensID)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AutoLightingOptimizer) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(AutoLightingOptimizer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HighlightTonePriority) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(HighlightTonePriority)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Quality) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(Quality)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CanonLog) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(CanonLog)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DefaultCropAbsolute) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(DefaultCropAbsolute)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RecommendedImageArea) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(RecommendedImageArea)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LeftOpticalBlack) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(LeftOpticalBlack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).UpperOpticalBlack) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(UpperOpticalBlack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ActiveArea) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ActiveArea)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISOgain) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ISOgain)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_hasselblad_makernotes_t {
    pub BaseISO: libc::c_int,
    pub Gain: f64,
    pub Sensor: [libc::c_char; 8usize],
    pub SensorUnit: [libc::c_char; 64usize],
    pub HostBody: [libc::c_char; 64usize],
    pub SensorCode: libc::c_int,
    pub SensorSubCode: libc::c_int,
    pub CoatingCode: libc::c_int,
    pub uncropped: libc::c_int,
    pub CaptureSequenceInitiator: [libc::c_char; 32usize],
    pub SensorUnitConnector: [libc::c_char; 64usize],
    pub format: libc::c_int,
    pub nIFD_CM: [libc::c_int; 2usize],
    pub RecommendedCrop: [libc::c_int; 2usize],
    pub mnColorMatrix: [[f64; 3usize]; 4usize],
}
#[test]
fn bindgen_test_layout_libraw_hasselblad_makernotes_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_hasselblad_makernotes_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_hasselblad_makernotes_t>(),
        384usize,
        concat!("Size of: ", stringify!(libraw_hasselblad_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_hasselblad_makernotes_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_hasselblad_makernotes_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BaseISO) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(BaseISO)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Gain) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(Gain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Sensor) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(Sensor)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SensorUnit) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(SensorUnit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HostBody) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(HostBody)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SensorCode) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(SensorCode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SensorSubCode) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(SensorSubCode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CoatingCode) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(CoatingCode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uncropped) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(uncropped)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CaptureSequenceInitiator) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(CaptureSequenceInitiator)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SensorUnitConnector) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(SensorUnitConnector)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nIFD_CM) as usize - ptr as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(nIFD_CM)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RecommendedCrop) as usize - ptr as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(RecommendedCrop)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mnColorMatrix) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(mnColorMatrix)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_fuji_info_t {
    pub ExpoMidPointShift: f32,
    pub DynamicRange: ushort,
    pub FilmMode: ushort,
    pub DynamicRangeSetting: ushort,
    pub DevelopmentDynamicRange: ushort,
    pub AutoDynamicRange: ushort,
    pub DRangePriority: ushort,
    pub DRangePriorityAuto: ushort,
    pub DRangePriorityFixed: ushort,
    pub BrightnessCompensation: f32,
    pub FocusMode: ushort,
    pub AFMode: ushort,
    pub FocusPixel: [ushort; 2usize],
    pub PrioritySettings: ushort,
    pub FocusSettings: libc::c_uint,
    pub AF_C_Settings: libc::c_uint,
    pub FocusWarning: ushort,
    pub ImageStabilization: [ushort; 3usize],
    pub FlashMode: ushort,
    pub WB_Preset: ushort,
    pub ShutterType: ushort,
    pub ExrMode: ushort,
    pub Macro: ushort,
    pub Rating: libc::c_uint,
    pub CropMode: ushort,
    pub SerialSignature: [libc::c_char; 13usize],
    pub SensorID: [libc::c_char; 5usize],
    pub RAFVersion: [libc::c_char; 5usize],
    pub RAFDataGeneration: libc::c_int,
    pub RAFDataVersion: ushort,
    pub isTSNERDTS: libc::c_int,
    pub DriveMode: libc::c_short,
    pub BlackLevel: [ushort; 9usize],
    pub RAFData_ImageSizeTable: [libc::c_uint; 32usize],
    pub AutoBracketing: libc::c_int,
    pub SequenceNumber: libc::c_int,
    pub SeriesLength: libc::c_int,
    pub PixelShiftOffset: [f32; 2usize],
    pub ImageCount: libc::c_int,
}
#[test]
fn bindgen_test_layout_libraw_fuji_info_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_fuji_info_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_fuji_info_t>(),
        280usize,
        concat!("Size of: ", stringify!(libraw_fuji_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_fuji_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_fuji_info_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ExpoMidPointShift) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(ExpoMidPointShift)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DynamicRange) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DynamicRange)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FilmMode) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(FilmMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DynamicRangeSetting) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DynamicRangeSetting)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DevelopmentDynamicRange) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DevelopmentDynamicRange)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AutoDynamicRange) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(AutoDynamicRange)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DRangePriority) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DRangePriority)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DRangePriorityAuto) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DRangePriorityAuto)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DRangePriorityFixed) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DRangePriorityFixed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BrightnessCompensation) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(BrightnessCompensation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusMode) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(FocusMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFMode) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(AFMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusPixel) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(FocusPixel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PrioritySettings) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(PrioritySettings)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusSettings) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(FocusSettings)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AF_C_Settings) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(AF_C_Settings)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusWarning) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(FocusWarning)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ImageStabilization) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(ImageStabilization)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashMode) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(FlashMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WB_Preset) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(WB_Preset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ShutterType) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(ShutterType)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ExrMode) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(ExrMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Macro) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(Macro)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Rating) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(Rating)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CropMode) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(CropMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SerialSignature) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(SerialSignature)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SensorID) as usize - ptr as usize },
        83usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(SensorID)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RAFVersion) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(RAFVersion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RAFDataGeneration) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(RAFDataGeneration)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RAFDataVersion) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(RAFDataVersion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).isTSNERDTS) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(isTSNERDTS)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DriveMode) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DriveMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BlackLevel) as usize - ptr as usize },
        110usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(BlackLevel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RAFData_ImageSizeTable) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(RAFData_ImageSizeTable)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AutoBracketing) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(AutoBracketing)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SequenceNumber) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(SequenceNumber)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SeriesLength) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(SeriesLength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PixelShiftOffset) as usize - ptr as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(PixelShiftOffset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ImageCount) as usize - ptr as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(ImageCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_sensor_highspeed_crop_t {
    pub cleft: ushort,
    pub ctop: ushort,
    pub cwidth: ushort,
    pub cheight: ushort,
}
#[test]
fn bindgen_test_layout_libraw_sensor_highspeed_crop_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_sensor_highspeed_crop_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_sensor_highspeed_crop_t>(),
        8usize,
        concat!("Size of: ", stringify!(libraw_sensor_highspeed_crop_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_sensor_highspeed_crop_t>(),
        2usize,
        concat!("Alignment of ", stringify!(libraw_sensor_highspeed_crop_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cleft) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sensor_highspeed_crop_t),
            "::",
            stringify!(cleft)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ctop) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sensor_highspeed_crop_t),
            "::",
            stringify!(ctop)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cwidth) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sensor_highspeed_crop_t),
            "::",
            stringify!(cwidth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cheight) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sensor_highspeed_crop_t),
            "::",
            stringify!(cheight)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_nikon_makernotes_t {
    pub ExposureBracketValue: f64,
    pub ActiveDLighting: ushort,
    pub ShootingMode: ushort,
    pub ImageStabilization: [uchar; 7usize],
    pub VibrationReduction: uchar,
    pub VRMode: uchar,
    pub FlashSetting: [libc::c_char; 13usize],
    pub FlashType: [libc::c_char; 20usize],
    pub FlashExposureCompensation: [uchar; 4usize],
    pub ExternalFlashExposureComp: [uchar; 4usize],
    pub FlashExposureBracketValue: [uchar; 4usize],
    pub FlashMode: uchar,
    pub FlashExposureCompensation2: libc::c_schar,
    pub FlashExposureCompensation3: libc::c_schar,
    pub FlashExposureCompensation4: libc::c_schar,
    pub FlashSource: uchar,
    pub FlashFirmware: [uchar; 2usize],
    pub ExternalFlashFlags: uchar,
    pub FlashControlCommanderMode: uchar,
    pub FlashOutputAndCompensation: uchar,
    pub FlashFocalLength: uchar,
    pub FlashGNDistance: uchar,
    pub FlashGroupControlMode: [uchar; 4usize],
    pub FlashGroupOutputAndCompensation: [uchar; 4usize],
    pub FlashColorFilter: uchar,
    pub NEFCompression: ushort,
    pub ExposureMode: libc::c_int,
    pub ExposureProgram: libc::c_int,
    pub nMEshots: libc::c_int,
    pub MEgainOn: libc::c_int,
    pub ME_WB: [f64; 4usize],
    pub AFFineTune: uchar,
    pub AFFineTuneIndex: uchar,
    pub AFFineTuneAdj: i8,
    pub LensDataVersion: libc::c_uint,
    pub FlashInfoVersion: libc::c_uint,
    pub ColorBalanceVersion: libc::c_uint,
    pub key: uchar,
    pub NEFBitDepth: [ushort; 4usize],
    pub HighSpeedCropFormat: ushort,
    pub SensorHighSpeedCrop: libraw_sensor_highspeed_crop_t,
    pub SensorWidth: ushort,
    pub SensorHeight: ushort,
    pub Active_D_Lighting: ushort,
    pub ShotInfoVersion: libc::c_uint,
    pub MakernotesFlip: libc::c_short,
    pub RollAngle: f64,
    pub PitchAngle: f64,
    pub YawAngle: f64,
}
#[test]
fn bindgen_test_layout_libraw_nikon_makernotes_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_nikon_makernotes_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_nikon_makernotes_t>(),
        224usize,
        concat!("Size of: ", stringify!(libraw_nikon_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_nikon_makernotes_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_nikon_makernotes_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ExposureBracketValue) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ExposureBracketValue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ActiveDLighting) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ActiveDLighting)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ShootingMode) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ShootingMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ImageStabilization) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ImageStabilization)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).VibrationReduction) as usize - ptr as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(VibrationReduction)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).VRMode) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(VRMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashSetting) as usize - ptr as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashSetting)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashType) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashType)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashExposureCompensation) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashExposureCompensation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ExternalFlashExposureComp) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ExternalFlashExposureComp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashExposureBracketValue) as usize - ptr as usize },
        62usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashExposureBracketValue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashMode) as usize - ptr as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashExposureCompensation2) as usize - ptr as usize },
        67usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashExposureCompensation2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashExposureCompensation3) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashExposureCompensation3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashExposureCompensation4) as usize - ptr as usize },
        69usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashExposureCompensation4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashSource) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashSource)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashFirmware) as usize - ptr as usize },
        71usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashFirmware)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ExternalFlashFlags) as usize - ptr as usize },
        73usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ExternalFlashFlags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashControlCommanderMode) as usize - ptr as usize },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashControlCommanderMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashOutputAndCompensation) as usize - ptr as usize },
        75usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashOutputAndCompensation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashFocalLength) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashFocalLength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashGNDistance) as usize - ptr as usize },
        77usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashGNDistance)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashGroupControlMode) as usize - ptr as usize },
        78usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashGroupControlMode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).FlashGroupOutputAndCompensation) as usize - ptr as usize
        },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashGroupOutputAndCompensation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashColorFilter) as usize - ptr as usize },
        86usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashColorFilter)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NEFCompression) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(NEFCompression)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ExposureMode) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ExposureMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ExposureProgram) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ExposureProgram)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nMEshots) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(nMEshots)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MEgainOn) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(MEgainOn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ME_WB) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ME_WB)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFFineTune) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(AFFineTune)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFFineTuneIndex) as usize - ptr as usize },
        145usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(AFFineTuneIndex)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFFineTuneAdj) as usize - ptr as usize },
        146usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(AFFineTuneAdj)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LensDataVersion) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(LensDataVersion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashInfoVersion) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashInfoVersion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ColorBalanceVersion) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ColorBalanceVersion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NEFBitDepth) as usize - ptr as usize },
        162usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(NEFBitDepth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HighSpeedCropFormat) as usize - ptr as usize },
        170usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(HighSpeedCropFormat)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SensorHighSpeedCrop) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(SensorHighSpeedCrop)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SensorWidth) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(SensorWidth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SensorHeight) as usize - ptr as usize },
        182usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(SensorHeight)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Active_D_Lighting) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(Active_D_Lighting)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ShotInfoVersion) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ShotInfoVersion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MakernotesFlip) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(MakernotesFlip)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RollAngle) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(RollAngle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PitchAngle) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(PitchAngle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).YawAngle) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(YawAngle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_olympus_makernotes_t {
    pub CameraType2: [libc::c_char; 6usize],
    pub ValidBits: ushort,
    pub SensorCalibration: [libc::c_int; 2usize],
    pub DriveMode: [ushort; 5usize],
    pub ColorSpace: ushort,
    pub FocusMode: [ushort; 2usize],
    pub AutoFocus: ushort,
    pub AFPoint: ushort,
    pub AFAreas: [libc::c_uint; 64usize],
    pub AFPointSelected: [f64; 5usize],
    pub AFResult: ushort,
    pub AFFineTune: uchar,
    pub AFFineTuneAdj: [libc::c_short; 3usize],
    pub SpecialMode: [libc::c_uint; 3usize],
    pub ZoomStepCount: ushort,
    pub FocusStepCount: ushort,
    pub FocusStepInfinity: ushort,
    pub FocusStepNear: ushort,
    pub FocusDistance: f64,
    pub AspectFrame: [ushort; 4usize],
    pub StackedImage: [libc::c_uint; 2usize],
    pub isLiveND: uchar,
    pub LiveNDfactor: libc::c_uint,
    pub Panorama_mode: ushort,
    pub Panorama_frameNum: ushort,
}
#[test]
fn bindgen_test_layout_libraw_olympus_makernotes_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_olympus_makernotes_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_olympus_makernotes_t>(),
        408usize,
        concat!("Size of: ", stringify!(libraw_olympus_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_olympus_makernotes_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_olympus_makernotes_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CameraType2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(CameraType2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ValidBits) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(ValidBits)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SensorCalibration) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(SensorCalibration)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DriveMode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(DriveMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ColorSpace) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(ColorSpace)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusMode) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(FocusMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AutoFocus) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AutoFocus)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFPoint) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AFPoint)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFAreas) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AFAreas)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFPointSelected) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AFPointSelected)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFResult) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AFResult)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFFineTune) as usize - ptr as usize },
        338usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AFFineTune)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFFineTuneAdj) as usize - ptr as usize },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AFFineTuneAdj)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SpecialMode) as usize - ptr as usize },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(SpecialMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ZoomStepCount) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(ZoomStepCount)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusStepCount) as usize - ptr as usize },
        362usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(FocusStepCount)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusStepInfinity) as usize - ptr as usize },
        364usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(FocusStepInfinity)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusStepNear) as usize - ptr as usize },
        366usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(FocusStepNear)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusDistance) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(FocusDistance)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AspectFrame) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AspectFrame)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).StackedImage) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(StackedImage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).isLiveND) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(isLiveND)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LiveNDfactor) as usize - ptr as usize },
        396usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(LiveNDfactor)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Panorama_mode) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(Panorama_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Panorama_frameNum) as usize - ptr as usize },
        402usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(Panorama_frameNum)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_panasonic_makernotes_t {
    pub Compression: ushort,
    pub BlackLevelDim: ushort,
    pub BlackLevel: [f32; 8usize],
    pub Multishot: libc::c_uint,
    pub gamma: f32,
    pub HighISOMultiplier: [libc::c_int; 3usize],
    pub FocusStepNear: libc::c_short,
    pub FocusStepCount: libc::c_short,
    pub ZoomPosition: libc::c_uint,
    pub LensManufacturer: libc::c_uint,
}
#[test]
fn bindgen_test_layout_libraw_panasonic_makernotes_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_panasonic_makernotes_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_panasonic_makernotes_t>(),
        68usize,
        concat!("Size of: ", stringify!(libraw_panasonic_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_panasonic_makernotes_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_panasonic_makernotes_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Compression) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(Compression)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BlackLevelDim) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(BlackLevelDim)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BlackLevel) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(BlackLevel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Multishot) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(Multishot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gamma) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(gamma)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HighISOMultiplier) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(HighISOMultiplier)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusStepNear) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(FocusStepNear)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusStepCount) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(FocusStepCount)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ZoomPosition) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(ZoomPosition)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LensManufacturer) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(LensManufacturer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_pentax_makernotes_t {
    pub DriveMode: [uchar; 4usize],
    pub FocusMode: [ushort; 2usize],
    pub AFPointSelected: [ushort; 2usize],
    pub AFPointSelected_Area: ushort,
    pub AFPointsInFocus_version: libc::c_int,
    pub AFPointsInFocus: libc::c_uint,
    pub FocusPosition: ushort,
    pub AFAdjustment: libc::c_short,
    pub AFPointMode: uchar,
    pub MultiExposure: uchar,
    pub Quality: ushort,
}
#[test]
fn bindgen_test_layout_libraw_pentax_makernotes_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_pentax_makernotes_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_pentax_makernotes_t>(),
        32usize,
        concat!("Size of: ", stringify!(libraw_pentax_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_pentax_makernotes_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_pentax_makernotes_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DriveMode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(DriveMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusMode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(FocusMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFPointSelected) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(AFPointSelected)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFPointSelected_Area) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(AFPointSelected_Area)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFPointsInFocus_version) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(AFPointsInFocus_version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFPointsInFocus) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(AFPointsInFocus)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusPosition) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(FocusPosition)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFAdjustment) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(AFAdjustment)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFPointMode) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(AFPointMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MultiExposure) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(MultiExposure)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Quality) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(Quality)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_ricoh_makernotes_t {
    pub AFStatus: ushort,
    pub AFAreaXPosition: [libc::c_uint; 2usize],
    pub AFAreaYPosition: [libc::c_uint; 2usize],
    pub AFAreaMode: ushort,
    pub SensorWidth: libc::c_uint,
    pub SensorHeight: libc::c_uint,
    pub CroppedImageWidth: libc::c_uint,
    pub CroppedImageHeight: libc::c_uint,
    pub WideAdapter: ushort,
    pub CropMode: ushort,
    pub NDFilter: ushort,
    pub AutoBracketing: ushort,
    pub MacroMode: ushort,
    pub FlashMode: ushort,
    pub FlashExposureComp: f64,
    pub ManualFlashOutput: f64,
}
#[test]
fn bindgen_test_layout_libraw_ricoh_makernotes_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_ricoh_makernotes_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_ricoh_makernotes_t>(),
        72usize,
        concat!("Size of: ", stringify!(libraw_ricoh_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_ricoh_makernotes_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_ricoh_makernotes_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFStatus) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(AFStatus)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFAreaXPosition) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(AFAreaXPosition)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFAreaYPosition) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(AFAreaYPosition)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFAreaMode) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(AFAreaMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SensorWidth) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(SensorWidth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SensorHeight) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(SensorHeight)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CroppedImageWidth) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(CroppedImageWidth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CroppedImageHeight) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(CroppedImageHeight)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).WideAdapter) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(WideAdapter)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CropMode) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(CropMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).NDFilter) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(NDFilter)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AutoBracketing) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(AutoBracketing)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MacroMode) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(MacroMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashMode) as usize - ptr as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(FlashMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlashExposureComp) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(FlashExposureComp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ManualFlashOutput) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(ManualFlashOutput)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_samsung_makernotes_t {
    pub ImageSizeFull: [libc::c_uint; 4usize],
    pub ImageSizeCrop: [libc::c_uint; 4usize],
    pub ColorSpace: [libc::c_int; 2usize],
    pub key: [libc::c_uint; 11usize],
    pub DigitalGain: f64,
    pub DeviceType: libc::c_int,
    pub LensFirmware: [libc::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_libraw_samsung_makernotes_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_samsung_makernotes_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_samsung_makernotes_t>(),
        136usize,
        concat!("Size of: ", stringify!(libraw_samsung_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_samsung_makernotes_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_samsung_makernotes_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ImageSizeFull) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(ImageSizeFull)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ImageSizeCrop) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(ImageSizeCrop)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ColorSpace) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(ColorSpace)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DigitalGain) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(DigitalGain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).DeviceType) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(DeviceType)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LensFirmware) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(LensFirmware)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_kodak_makernotes_t {
    pub BlackLevelTop: ushort,
    pub BlackLevelBottom: ushort,
    pub offset_left: libc::c_short,
    pub offset_top: libc::c_short,
    pub clipBlack: ushort,
    pub clipWhite: ushort,
    pub romm_camDaylight: [[f32; 3usize]; 3usize],
    pub romm_camTungsten: [[f32; 3usize]; 3usize],
    pub romm_camFluorescent: [[f32; 3usize]; 3usize],
    pub romm_camFlash: [[f32; 3usize]; 3usize],
    pub romm_camCustom: [[f32; 3usize]; 3usize],
    pub romm_camAuto: [[f32; 3usize]; 3usize],
    pub val018percent: ushort,
    pub val100percent: ushort,
    pub val170percent: ushort,
    pub MakerNoteKodak8a: libc::c_short,
    pub ISOCalibrationGain: f32,
    pub AnalogISO: f32,
}
#[test]
fn bindgen_test_layout_libraw_kodak_makernotes_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_kodak_makernotes_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_kodak_makernotes_t>(),
        244usize,
        concat!("Size of: ", stringify!(libraw_kodak_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_kodak_makernotes_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_kodak_makernotes_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BlackLevelTop) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(BlackLevelTop)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BlackLevelBottom) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(BlackLevelBottom)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).offset_left) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(offset_left)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).offset_top) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(offset_top)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clipBlack) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(clipBlack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clipWhite) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(clipWhite)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).romm_camDaylight) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(romm_camDaylight)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).romm_camTungsten) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(romm_camTungsten)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).romm_camFluorescent) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(romm_camFluorescent)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).romm_camFlash) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(romm_camFlash)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).romm_camCustom) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(romm_camCustom)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).romm_camAuto) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(romm_camAuto)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).val018percent) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(val018percent)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).val100percent) as usize - ptr as usize },
        230usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(val100percent)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).val170percent) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(val170percent)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MakerNoteKodak8a) as usize - ptr as usize },
        234usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(MakerNoteKodak8a)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ISOCalibrationGain) as usize - ptr as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(ISOCalibrationGain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AnalogISO) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(AnalogISO)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_p1_makernotes_t {
    pub Software: [libc::c_char; 64usize],
    pub SystemType: [libc::c_char; 64usize],
    pub FirmwareString: [libc::c_char; 256usize],
    pub SystemModel: [libc::c_char; 64usize],
}
#[test]
fn bindgen_test_layout_libraw_p1_makernotes_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_p1_makernotes_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_p1_makernotes_t>(),
        448usize,
        concat!("Size of: ", stringify!(libraw_p1_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_p1_makernotes_t>(),
        1usize,
        concat!("Alignment of ", stringify!(libraw_p1_makernotes_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Software) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_p1_makernotes_t),
            "::",
            stringify!(Software)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SystemType) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_p1_makernotes_t),
            "::",
            stringify!(SystemType)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FirmwareString) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_p1_makernotes_t),
            "::",
            stringify!(FirmwareString)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SystemModel) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_p1_makernotes_t),
            "::",
            stringify!(SystemModel)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_sony_info_t {
    pub CameraType: ushort,
    pub Sony0x9400_version: uchar,
    pub Sony0x9400_ReleaseMode2: uchar,
    pub Sony0x9400_SequenceImageNumber: libc::c_uint,
    pub Sony0x9400_SequenceLength1: uchar,
    pub Sony0x9400_SequenceFileNumber: libc::c_uint,
    pub Sony0x9400_SequenceLength2: uchar,
    pub AFAreaModeSetting: u8,
    pub AFAreaMode: u16,
    pub FlexibleSpotPosition: [ushort; 2usize],
    pub AFPointSelected: u8,
    pub AFPointSelected_0x201e: u8,
    pub nAFPointsUsed: libc::c_short,
    pub AFPointsUsed: [u8; 10usize],
    pub AFTracking: u8,
    pub AFType: u8,
    pub FocusLocation: [ushort; 4usize],
    pub FocusPosition: ushort,
    pub AFMicroAdjValue: i8,
    pub AFMicroAdjOn: i8,
    pub AFMicroAdjRegisteredLenses: uchar,
    pub VariableLowPassFilter: ushort,
    pub LongExposureNoiseReduction: libc::c_uint,
    pub HighISONoiseReduction: ushort,
    pub HDR: [ushort; 2usize],
    pub group2010: ushort,
    pub group9050: ushort,
    pub real_iso_offset: ushort,
    pub MeteringMode_offset: ushort,
    pub ExposureProgram_offset: ushort,
    pub ReleaseMode2_offset: ushort,
    pub MinoltaCamID: libc::c_uint,
    pub firmware: f32,
    pub ImageCount3_offset: ushort,
    pub ImageCount3: libc::c_uint,
    pub ElectronicFrontCurtainShutter: libc::c_uint,
    pub MeteringMode2: ushort,
    pub SonyDateTime: [libc::c_char; 20usize],
    pub ShotNumberSincePowerUp: libc::c_uint,
    pub PixelShiftGroupPrefix: ushort,
    pub PixelShiftGroupID: libc::c_uint,
    pub nShotsInPixelShiftGroup: libc::c_char,
    pub numInPixelShiftGroup: libc::c_char,
    pub prd_ImageHeight: ushort,
    pub prd_ImageWidth: ushort,
    pub prd_Total_bps: ushort,
    pub prd_Active_bps: ushort,
    pub prd_StorageMethod: ushort,
    pub prd_BayerPattern: ushort,
    pub SonyRawFileType: ushort,
    pub RAWFileType: ushort,
    pub RawSizeType: ushort,
    pub Quality: libc::c_uint,
    pub FileFormat: ushort,
    pub MetaVersion: [libc::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_libraw_sony_info_t() {
    const UNINIT: ::core::mem::MaybeUninit<libraw_sony_info_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<libraw_sony_info_t>(),
        180usize,
        concat!("Size of: ", stringify!(libraw_sony_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_sony_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_sony_info_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).CameraType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(CameraType)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Sony0x9400_version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(Sony0x9400_version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Sony0x9400_ReleaseMode2) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(Sony0x9400_ReleaseMode2)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Sony0x9400_SequenceImageNumber) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(Sony0x9400_SequenceImageNumber)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Sony0x9400_SequenceLength1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(Sony0x9400_SequenceLength1)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).Sony0x9400_SequenceFileNumber) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(Sony0x9400_SequenceFileNumber)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).Sony0x9400_SequenceLength2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(Sony0x9400_SequenceLength2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFAreaModeSetting) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFAreaModeSetting)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFAreaMode) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFAreaMode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FlexibleSpotPosition) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(FlexibleSpotPosition)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFPointSelected) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFPointSelected)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFPointSelected_0x201e) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFPointSelected_0x201e)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nAFPointsUsed) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(nAFPointsUsed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFPointsUsed) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFPointsUsed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFTracking) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFTracking)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFType) as usize - ptr as usize },
        39usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFType)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusLocation) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(FocusLocation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).FocusPosition) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(FocusPosition)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFMicroAdjValue) as usize - ptr as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFMicroAdjValue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFMicroAdjOn) as usize - ptr as usize },
        51usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFMicroAdjOn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).AFMicroAdjRegisteredLenses) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFMicroAdjRegisteredLenses)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).VariableLowPassFilter) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(VariableLowPassFilter)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).LongExposureNoiseReduction) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(LongExposureNoiseReduction)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HighISONoiseReduction) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(HighISONoiseReduction)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).HDR) as usize - ptr as usize },
        62usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(HDR)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).group2010) as usize - ptr as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(group2010)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).group9050) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(group9050)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).real_iso_offset) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(real_iso_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MeteringMode_offset) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(MeteringMode_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ExposureProgram_offset) as usize - ptr as usize },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(ExposureProgram_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ReleaseMode2_offset) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(ReleaseMode2_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MinoltaCamID) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(MinoltaCamID)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(firmware)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ImageCount3_offset) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(ImageCount3_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ImageCount3) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(ImageCount3)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).ElectronicFrontCurtainShutter) as usize - ptr as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(ElectronicFrontCurtainShutter)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).MeteringMode2) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(MeteringMode2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SonyDateTime) as usize - ptr as usize },
        102usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(SonyDateTime)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ShotNumberSincePowerUp) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(ShotNumberSincePowerUp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PixelShiftGroupPrefix) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(PixelShiftGroupPrefix)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).PixelShiftGroupID) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(PixelShiftGroupID)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nShotsInPixelShiftGroup) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(nShotsInPixelShiftGroup)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).numInPixelShiftGroup) as usize - ptr as usize },
        137usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(numInPixelShiftGroup)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prd_ImageHeight) as usize - ptr as usize },
        138usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(prd_ImageHeight)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prd_ImageWidth) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(prd_ImageWidth)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prd_Total_bps) as usize - ptr as usize },
        142usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(prd_Total_bps)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prd_Active_bps) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(prd_Active_bps)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prd_StorageMethod) as usize - ptr as usize },
        146usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(prd_StorageMethod)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prd_BayerPattern) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(prd_BayerPattern)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SonyRawFileType) as usize - ptr as usize },
        150usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(SonyRawFileType)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RAWFileType) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(RAWFileType)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).RawSizeType) as usize - ptr as usize },
        154usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(RawSizeType)
